[{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "VIE - Business planning & analysis coordinator (M/W)",
  "jobUrl": "https://ae.linkedin.com/jobs/view/vie-business-planning-analysis-coordinator-m-w-at-herm%C3%A8s-3928525779?trk=public_jobs_topcard-title",
  "companyName": "Hermès",
  "companyUrl": "https://fr.linkedin.com/company/hermes-group?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "General mission\n\nProvide daily support to two Area Managers for local markets, including main responsibilities such as monitoring Business Plans by market (monthly sales reports for Sell In, Wholesale & Sell Out, by door and by retailer), managing orders & invoicing, overseeing sales forecasts including new product launches, and handling sanitary registrations.\n\nZones covered: MEIA (Middle East, India and Africa)\n\nMain missions\n\n\n * Planning & Forecasting\n   \n   \n\nExtract and ensure monthly sales forecasts are ordered by customers\n\nAdjust and communicate to the Demand Planning team the consumption of remaining forecasts\n\nPlan POSM elements according to business needs and creation plans, with the support of Marketing and Training departments\n\n\n * Orders\n   \n   \n\nPrepare and communicate to distributors their orders according to forecasts\n\nMonitor receipt of monthly orders, ensuring that they are in line with their forecasts and received on time. Close communication with Area Managers of any discrepancies or observations\n\nCoordinate with Customer Service and Area Managers on order status\n\nOpen new customer and supplier accounts when necessary\n\nImplement changes in price structures and incoterms with Area Managers\n\n\n * Registration\n   \n   \n\nCoordinate with Brand Managers and Head Office team to anticipate and finalize new product registrations on time\n\nMaintain up-to-date database of registration procedures\n\n\n * Business Plans\n   \n   \n\nMonthly update of Business Plans with Sell In/Purchase data and communication to markets\n\nEnsure monthly receipt of Business Plans by market with updated data (Wholesale and Sell Out by line, door and retailer)\n\nVerify that monthly Business Plans by market are always complete and correct (formulas and analysis) and ensure data quality\n\nMonthly analysis of the received data and communication of the key information to Area Managers\n\n\n * Other tasks\n   \n   \n\nUpdate invoicing and market performance monitoring tools\n\nCollaborate with the finance department on the quality of data reported to headquarters\n\nProfile\n\nHigher education background\n\n\n * You are hands-on with a number driven approach and a strong interest in business development\n * You are autonomous and recognized for your organization skills\n * You have strong analytical and critical thinking mindset and know how to communicate effectively\n * You have a perfect knowledge of Excel (advanced level) and PowerPoint\n * You are familiar with the world of selective distribution and are detail oriented\n * Fluent in English (French is a plus)",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Research, Analyst, and Information Technology",
  "sector": "Retail Luxury Goods and Jewelry",
  "applyUrl": "https://talents.hermes.com/en/opportunities/300001716410074en-vie-business-planning-analysis-coordinator-m-w?sType=LinkedIn_Sponsored&utm_medium=jobboard&utm_source=LinkedIn_sponsored_default",
  "applyType": "EXTERNAL",
  "companyId": "2999687",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "استشاري العقارات",
  "jobUrl": "https://ae.linkedin.com/jobs/view/%D8%A7%D8%B3%D8%AA%D8%B4%D8%A7%D8%B1%D9%8A-%D8%A7%D9%84%D8%B9%D9%82%D8%A7%D8%B1%D8%A7%D8%AA-at-royal-contact-3979896283?trk=public_jobs_topcard-title",
  "companyName": "Royal Contact",
  "companyUrl": "https://ae.linkedin.com/company/royal-contact-re?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "46 minutes ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "⁦ Role: Property Consultant\n\nLocation: Dubai, deira\n\nCompensation: up to 50% Commissions\n\n\n\n\n?Why choose Royal Contact Dubai\n\n * We are a startup Real Estate Company in Dubai and experts in Dubai Market.\n * Inbound and Fresh leads from 25+ countries around the globe.\n * Earn up to 50% commissions, rewarding your dedication and results.\n * We are rapidly growing and expanding our portfolio on the off-plan and secondary markets.\n * World-Class Support and Benefit from our industry-leading training programs, innovative technology platform, and marketing resources.\n * We believe personal development, training, and product knowledge are the keys to success, and we invest heavily in that.\n * All our employees have the opportunity to grow and succeed, we encourage everyone to set goals and fulfill their aspirations.\n * You will be a part of a diversified and friendly work environment and leverage the global reputation and resources of the Keller Williams brand.\n * We valued everyone with exciting international trips and best gifts as prestigious awards. and quarterly R&R events.\n\n\n\n\nBenefits\n\n * Employment Visa after the first closing deal.\n * RERA Certificate.\n * Generating Qualified Leads.\n * Full CRM & Marketing Support.\n * Employment visa and medical insurance provided.\n * Company phone and SIM card.\n\n\n\n\n⁦⁩Duties & Responsibilities\n\n * Consistently follow up with leads in your pipeline to ensure sales growth.\n * Oversee the closing process to provide clients with an efficient and smooth transaction experience.\n * Maintain consistent follow-up to grow the sales pipeline.\n * Always provide the best service and advice to nurture client relationships and generate repeat and referral customers.\n * Actively network and find new clients.\n\n\n\n\n⁦⁩Requirements\n\n * Minimum 6 months of Dubai real estate sales experience.\n * Strong desire for financial growth.\n * Professional appearance and work ethics.\n * Exceptional customer service and negotiation skills.\n * Fluent in English language\n * Proficient in written and verbal communication.\n\n\n\n\n⁩",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Sales and Management",
  "sector": "Real Estate",
  "applyType": "EASY_APPLY",
  "applyUrl": "https://ae.linkedin.com/jobs/view/%D8%A7%D8%B3%D8%AA%D8%B4%D8%A7%D8%B1%D9%8A-%D8%A7%D9%84%D8%B9%D9%82%D8%A7%D8%B1%D8%A7%D8%AA-at-royal-contact-3979896283?trk=public_jobs_topcard-title",
  "companyId": "103771470",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Communication Sr. Specialist",
  "jobUrl": "https://ae.linkedin.com/jobs/view/communication-sr-specialist-at-geidea-3928963305?trk=public_jobs_topcard-title",
  "companyName": "geidea",
  "companyUrl": "https://sa.linkedin.com/company/geidea?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Established in 2008, Geidea epitomises customer focused empowerment and commercial success through continuous innovation\n\nGeidea makes best in class digital payment solutions available for all by attracting and leveraging the best creative & entrepreneurial talent in the market\n\nOur solutions give any business the chance to get ahead and reach for more no matter their size or maturity.\n\nOur technology mirrors our people - Smart, Innovative & Forward Thinking\n\nwww.geidea.net\n\nTo maintain competitive advantage as we grow, we are currently looking for a new Technology Communication Sr. Specialist (UAE National).\n\nJob purpose:\n\nResponsible for translating complex strategic concepts and plans into visually engaging and informative collateral. This individual will work closely with cross-functional teams, executives, and stakeholders to transform strategic insights and data into compelling narratives that effectively communicate the company's goals, initiatives, and progress.\n\nResponsibilities:\n\n\n * Strategy Understanding: Collaborate with senior management, strategists, and subject matter experts to gain a deep understanding of the company's strategic objectives and priorities.\n * Content Synthesis: Analyze and synthesize complex data, reports, and strategic documents to distill key insights and messages.\n * Storytelling: Develop persuasive narratives that convey the strategic direction of the company, highlighting key objectives, challenges, and opportunities.\n * Communication Ambassador: Proactively drive team communication, establish a formal communication plan and toolset to communicate and make information available to teams. Collaborate with other C-suite executives to ensure technology alignment with overall business objectives.\n * Information Flow: Ensure logical flow and structure of IT concepts, making it easy for the audience to follow and understand the content.\n * Data Visualization: Transform quantitative and qualitative data into clear, concise, and visually engaging charts and diagrams.\n * Revisions and Feedback: Collaborate with stakeholders to incorporate feedback and revisions into It & product roadmaps, ensuring accuracy and alignment with strategic goals.\n * Time Management: Manage multiple initiatives simultaneously, prioritize tasks, and meet deadlines.\n   \n   \n   \n\nRequirements:\n\n\n * 5-7 years of experience\n * Bachelor's/Masters degree in a relevant field (e.g., Business, Marketing, Communication, Graphic Design).\n * Previous experience in financial services or Fintech would be helpful.\n * Proven experience in creating high-quality communication material\n * Strong understanding of business strategy and the ability to distil complex concepts into clear and concise messages.\n * Proficiency in Microsoft PowerPoint, including advanced knowledge of formatting, animation, and graphic design features.\n * Excellent communication and interpersonal skills.\n * Attention to detail and a keen eye for aesthetics.\n * Creativity and the ability to think visually.\n * Familiarity with data visualization tools and techniques (e.g., Excel, Tableau) is a plus.\n   \n   \n   \n\nGeidea’s Values:\n\n\n * Customer first\n * Open\n * Real\n * Bold\n * Resilient\n * Collaborative\n   \n   \n   \n\nOur values guide how we think and act - They describe what we care about the most\n\nCustomer first - It’s embedded in our design thinking and customer service approach\n\nOpen - Openness allows us to constantly improve and evolve\n\nReal - No jargon and no excuses!\n\nBold - Constantly challenging ourselves and our way of thinking\n\nResilient – If we fail, we bounce back stronger than before\n\nCollaborative - We know that we can achieve a lot more as a team\n\nWe are changing lives by constantly striving for a better solution\n\n\n * Click apply below and become part of the Geidea story",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Marketing, Public Relations, and Writing/Editing",
  "sector": "Financial Services",
  "applyUrl": "https://careers.geidea.net/job/Dubai-Communication-Sr_-Specialist/854645923/",
  "applyType": "EXTERNAL",
  "companyId": "3322847",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Oil Free Air Technical Specialist",
  "jobUrl": "https://ae.linkedin.com/jobs/view/oil-free-air-technical-specialist-at-aggreko-3927119209?trk=public_jobs_topcard-title",
  "companyName": "Aggreko",
  "companyUrl": "https://uk.linkedin.com/company/aggreko?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "We're the global leader in providing energy solutions that help businesses grow and communities thrive.\n\nWe work as a team and we’re proud of the difference we make to customers, to local communities, and towards a sustainable future for the world. \n\nWe are hiring immediately Oil Free Air Technical Specialist - a role that will help us to power progress for our customers.\n\nWhy Join Aggreko?\n\n\n * Full time position based in Jebel Ali, Dubai\n * A competitive salary and benefits package\n * A genuine focus on continued personal development and learning.\n * Access to our Employee Assistance Programme, which helps promote and support a healthy lifestyle.\n * Safety-focused culture\n   \n   \n\nRole overview: The Oil Free Air Technical Specialist ensures the successful introduction and integration of new products into the Middle East business by delivering highly specialised technical support.\n\nWhat You’ll Do\n\n\n * Subject Matter Expertise and Knowledge Transfer: Build personal knowledge of Aggreko's new products and aspire to become a subject matter expert. Guide and influence local technical teams, transferring knowledge and building capabilities. Support the Learning team with design and delivery of training solutions.\n * Technical Support and Customer Excellence: Elevate the business’s customer experience by delivering expert assistance in addressing technical inquiries, contributing to the development of documented guidance, troubleshooting, and resolving issues, as well as optimising performance during the new product introduction and infancy care period. Conduct rigorous testing, validation, and documentation of solutions, with a specific emphasis on performing failure analysis and Root Cause Analysis (RCA) for new products.\n * Collaboration and Project Implementation: Liaise with Aggreko sales, technicians, and management to provide technical solutions, and lead project implementation in early mobilisations or first-of-a-kind projects, with emphasis on design, commissioning, and knowledge transfer.\n * Promote Green Solutions: Lead site and project delivery of hybridized and low emission solutions, setting an example for greener upgrades and ensuring success for customers.\n * Technical Drawings: Interpret, modify, and create layout, arrangement, and technical drawings using CAD and sketch tools. Analyse technical drawings to establish parameters for safe and efficient solutions.\n * Health, Safety and Continuous Improvement: Specialise in understanding the risks associated with new power products. Ensure compliance with Aggreko HSE policies and procedures. Provide feedback and contribute to the continuous improvement of products and integration processes.\n   \n   \n\nYou’ll Have The Following Skills And Experience\n\n\n * University degree or above, science and engineering background (prefer one of below: Electrical, hydraulics, pneumatics and/or power, Measurement and control technology and instruments)\n * Minimum 5-7 years product technical hands-on experience in mechanical engineering.\n * Proven experience on compressed air, rotating and air drier equipment\n * Should have very good analytical skills\n * Understanding of AC and DC power, 3 phase system, components\n * Should possess a good knowledge of electrical, pneumatic and mechanical systems\n * Robust technical proficiency with an exceptional mastery, specifically concentrated on emerging products. Familiarity with emerging trends in the industry\n * Strong analytical and problem-solving capabilities. Growth mindset, with the ability to thrive in a dynamic and collaborative environment.\n * Excellent communication and collaboration abilities.\n * Dedication to safety, quality, and customer experience, coupled with a familiarity with industry regulations and standards\n * In-depth understanding of factors critical for successful new product introduction and integration. Possesses basic project management skills.\n * Proficient in the use of CAD and Sketch tools\n   \n   \n\nFind out more and apply now.\n\nBring your energy. Grow your career.\n\nAbout Aggreko\n\nWe welcome people from different backgrounds and cultures, and respect people’s unique skills, attitudes and experiences. We encourage everyone to be themselves at work because we know that’s how we do our best, for each other, for our customers, for the communities where we work, and for our careers.\n\nEqual Opportunity Employer, including disability and veterans.\n\n",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Other",
  "sector": "Utilities",
  "applyUrl": "https://aggreko.wd3.myworkdayjobs.com/Aggreko_Careers_1/job/AME-Dubai/Oil-Free-Air-Technical-Specialist_JR12108?source=Linkedin",
  "applyType": "EXTERNAL",
  "companyId": "13151",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Quality Analyst",
  "jobUrl": "https://ae.linkedin.com/jobs/view/quality-analyst-3979480918?trk=public_jobs_topcard-title",
  "companyName": "",
  "companyUrl": "",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "13 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "The quality analyst is responsible for developing and supporting the planning, design, and execution of test plans, test scripts, and process plans for projects. The successful candidate will work closely with various departments to perform and validate test cases based on quality requirements, and recommend changes to predetermined quality guidelines. You will be responsible for ensuring that the end product meets the minimum quality standards, is fully functional and user-friendly.\n\nQuality Analyst Responsibilities\n\nDevelop and execute test plans to ensure that all objectives are met.\n\nImplement and monitor test scripts to assess functionality, reliability, performance, and quality of the service or product.\n\nIdentify and remedy defects within the production process.\n\nOther Details\n\nSalary-30,000/- to 75,000/-\n\nRequired Experience-0 To 5\n\nMinimum Age-18\n\nQuality Analyst Requirements\n\nQualification Required-Diploma,B.tech,M.tech,BCA,MCA,Bsc.IT,Msc.IT,\n\nA bachelor's degree in computer science, information systems or a related field.\n\nWork Department-Data Scientist,QA Tester,Quality Analyst\n\nWork Industry-IT,Manufacturing,FMCG\n\nSkills-Strong computer skills and knowledge of QA databases and applications.\n\nfor more clarification contact to this number-9821323366\n\nsrv9082@gmail.com\n\nRegards\n\nHR Placement Team\n\nThis job is provided by Shine.com",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Quality Assurance",
  "sector": "Staffing and Recruiting",
  "applyUrl": "https://www.shine.com/jobs/quality-analyst/neelima-staffing-solution/15283730/?utm_source=linkedin-feed&amp;utm_medium=referral&amp;utm_campaign=linkedin-feed&amp;auto_apply=true",
  "applyType": "EXTERNAL",
  "companyId": "",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Product Research Analyst",
  "jobUrl": "https://ae.linkedin.com/jobs/view/product-research-analyst-at-intoude-foundation-too-3978940746?trk=public_jobs_topcard-title",
  "companyName": "Intoude Foundation Too",
  "companyUrl": "https://www.linkedin.com/company/intoude-foundation-too?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "13 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Job Description\n\nWe are looking for an experienced Freelance Product Research Analyst who will conduct thorough research and analysis to uncover insights into consumer preferences, market trends, and competitive landscapes. This role offers the flexibility to work remotely, allowing you to manage your schedule while delivering actionable insights that inform our product development decisions.\n\nKey Responsibilities:\n\n\n * Market Analysis: Conduct comprehensive research on consumer preferences, market trends, and competitive products. Utilize qualitative and quantitative research methods to gather and analyze data.\n * Consumer Insights: Gather insights into consumer behaviors, needs, and preferences through surveys, interviews, and focus groups. Translate findings into actionable recommendations for product development.\n * Competitive Analysis: Analyze competitor products, pricing strategies, and market positioning. Identify strengths, weaknesses, opportunities, and threats to our product portfolio.\n * Trend Identification: Monitor industry trends, technological advancements, and emerging consumer preferences. Provide insights and recommendations for innovative product features and improvements.\n * Data Interpretation: Analyze complex datasets to extract meaningful insights and trends. Use statistical tools and data visualization techniques to present findings effectively.\n * Reporting: Prepare clear and concise reports and presentations summarizing research findings and strategic recommendations. Present findings to stakeholders and collaborate with cross-functional teams.\n * Collaboration: Work closely with product development, marketing, and sales teams to align research findings with product strategies and business objectives.\n * Project Management: Manage multiple research projects simultaneously, ensuring timely delivery and adherence to quality standards.\n   \n   \n\nQualifications:\n\n\n * Experience: Entry- Level\n * Education: Bachelor’s degree in Marketing, Business Administration, Economics, Psychology, or a related field. Advanced degree (Master’s) preferred.\n * Research Skills: Proficiency in qualitative and quantitative research methodologies, including survey design, interviews, and data analysis tools.\n * Analytical Abilities: Strong analytical skills with the ability to interpret data, identify trends, and make data-driven recommendations.\n * Communication Skills: Excellent written and verbal communication skills. Ability to present complex information in a clear and actionable manner.\n * Detail-Oriented: High attention to detail and accuracy in data collection, analysis, and reporting.\n * Team Player: Strong interpersonal skills and the ability to collaborate effectively with team members and stakeholders.\n   \n   \n\nBenefits:\n\n\n * Competitive project-based compensation.\n * Remote work flexibility.\n * Opportunity to contribute to innovative product development projects.\n * Collaborative and supportive team environment.\n * Professional development opportunities.\n   \n   \n\nApplication Process:\n\nIf you are passionate about product research and analysis and have a track record of delivering actionable insights that drive successful product launches, we encourage you to apply.",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Research, Analyst, and Information Technology",
  "sector": "Human Resources Services",
  "applyUrl": "https://voliagency.teamtailor.com/jobs/4758516-product-research-analyst",
  "applyType": "EXTERNAL",
  "companyId": "103725386",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Brand Research Analyst",
  "jobUrl": "https://ae.linkedin.com/jobs/view/brand-research-analyst-at-intoude-foundation-too-3978945083?trk=public_jobs_topcard-title",
  "companyName": "Intoude Foundation Too",
  "companyUrl": "https://www.linkedin.com/company/intoude-foundation-too?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "13 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Job Description\n\nWe are looking for an experienced Freelance Brand Research Analyst who will conduct comprehensive research to uncover valuable insights about consumer perceptions, market trends, and competitive landscapes. This role offers the flexibility to work remotely, allowing you to manage your schedule while delivering actionable insights that shape our brand strategies.\n\nKey Responsibilities:\n\n\n * Brand Perception Analysis: Conduct research to understand consumer perceptions of our brand and competitors. Utilize qualitative and quantitative research methods to gather and analyze data.\n * Market Trends Identification: Monitor market trends, consumer preferences, and industry developments that impact brand strategy. Provide insights and recommendations based on research findings.\n * Competitive Benchmarking: Analyze competitors’ branding strategies, positioning, and market share. Identify opportunities and threats to inform our brand strategy.\n * Consumer Insights: Gather insights into consumer behaviors, attitudes, and motivations through surveys, focus groups, and data analysis. Translate findings into actionable recommendations.\n * Strategic Recommendations: Develop actionable recommendations to enhance brand positioning, messaging, and overall brand equity. Present findings and strategies to stakeholders in clear, compelling reports and presentations.\n * Collaboration: Collaborate with cross-functional teams including marketing, product development, and sales to align brand research findings with business objectives.\n * Project Management: Manage research projects from inception to completion, ensuring timely delivery and adherence to quality standards.\n   \n   \n\nQualifications:\n\n\n * Experience: Entry – Level\n * Education: Bachelor’s degree in Marketing, Business Administration, Psychology, Sociology, or a related field. Advanced degree (Master’s) preferred.\n * Research Skills: Proficiency in qualitative and quantitative research methodologies, including survey design, focus groups, and data analysis tools.\n * Analytical Abilities: Strong analytical skills with the ability to interpret complex data and distill insights into actionable recommendations.\n * Communication Skills: Excellent written and verbal communication skills. Ability to present research findings and recommendations effectively to diverse audiences.\n * Detail-Oriented: High attention to detail and accuracy in data collection, analysis, and reporting.\n * Team Player: Strong interpersonal skills and the ability to collaborate effectively with team members and stakeholders.\n   \n   \n\nBenefits:\n\n\n * Competitive project-based compensation.\n * Remote work flexibility.\n * Opportunity to work on impactful projects that shape our brand strategy.\n * Collaborative and supportive team environment.\n * Professional development opportunities.\n   \n   \n\nApplication Process:\n\nIf you are passionate about brand research and strategy and have a track record of delivering actionable insights that drive business success, we encourage you to apply.",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Research, Analyst, and Information Technology",
  "sector": "Human Resources Services",
  "applyUrl": "https://voliagency.teamtailor.com/jobs/4758525-brand-research-analyst",
  "applyType": "EXTERNAL",
  "companyId": "103725386",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Customer Support Specialist",
  "jobUrl": "https://ae.linkedin.com/jobs/view/customer-support-specialist-at-intoude-foundation-too-3979545046?trk=public_jobs_topcard-title",
  "companyName": "Intoude Foundation Too",
  "companyUrl": "https://www.linkedin.com/company/intoude-foundation-too?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "1 hour ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Responsibilities:\n\n\n * Serve as the first point of contact for customers, providing timely and professional assistance via phone, email, and live chat.\n * Address customer inquiries, concerns, and feedback with empathy and efficiency, ensuring a positive resolution to every interaction.\n * Troubleshoot technical issues and guide customers through product features and functionalities.\n * Process orders, returns, and refunds accurately and in accordance with company policies and procedures.\n * Maintain thorough and accurate records of customer interactions and transactions in our CRM system.\n * Collaborate with cross-functional teams to escalate complex issues and ensure timely resolution.\n * Continuously identify opportunities for process improvement and contribute to the development of best practices for customer support.\n   \n   \n\nRequirements:\n\n\n * High school diploma or equivalent; bachelor's degree preferred.\n * Proven experience in customer service or a related field, with a strong track record of delivering exceptional customer experiences.\n * Excellent communication skills, both verbal and written, with the ability to articulate complex concepts in a clear and concise manner.\n * Strong problem-solving skills and the ability to think quickly on your feet.\n * Empathetic and patient demeanor, with a genuine desire to help others.\n * Proficiency in using customer support software and CRM systems.\n * Ability to multitask and prioritize in a fast-paced environment.\n * Positive attitude and willingness to go above and beyond to meet customer needs.\n   \n   \n\nWhat We Offer:\n\n\n * Competitive salary and benefits package, including health insurance and retirement savings options.\n * Flexible work schedule and the opportunity to work remotely from anywhere in the world.\n * Ongoing training and professional development opportunities to enhance your skills and advance your career.\n * Supportive team environment where your contributions are valued and recognized.\n   \n   \n\nJoin Our Team:\n\nIf you're ready to take your customer service skills to the next level and make a meaningful impact in a dynamic and supportive environment, we want to hear from you! Apply now to join our team as a Customer Support Specialist and help us deliver exceptional service to our customers.",
  "contractType": "Full-time",
  "experienceLevel": "Entry level",
  "workType": "Other",
  "sector": "Human Resources Services",
  "applyUrl": "https://voliagency.teamtailor.com/jobs/4758585-customer-support-specialist",
  "applyType": "EXTERNAL",
  "companyId": "103725386",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Senior Martech Manager",
  "jobUrl": "https://ae.linkedin.com/jobs/view/senior-martech-manager-at-property-finder-3927701414?trk=public_jobs_topcard-title",
  "companyName": "Property Finder",
  "companyUrl": "https://ae.linkedin.com/company/propertyfinder-ae?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Over 200 applicants",
  "description": "Founded by Michael Lahyani in 2005 as a magazine (Al Bab World), Property Finder today is a single technology platform and brand across multiple countries in the MENA region. We offer the most advanced tools and best-in-class user experience for homeseekers, real estate brokers, and developers. Property Finder's most recent valuation secures our status among the Middle East's emerging unicorns, affirming a growth-oriented identity.\n\nOver the years, we've expanded our operations to Bahrain, Egypt, Qatar, Saudi Arabia, and secured a strategic shareholding in Hepsiemlak, the leading property portal in Turkey. With over 600+ dedicated people in 6 regional offices, we facilitate more than 14 million monthly visits across our platforms, solidifying our position as a regional powerhouse in the proptech space.\n\nAs the pioneering portal for homeseekers in the region, we are on a mission to motivate and inspire people to live the life they deserve.\n\nPosition Title\n\nSenior Martech Manager\n\nReports To\n\nPrincipal Martech Manager\n\nPosition Summary\n\nSenior Martech Manager at Property Finder sits at a unique intersection of marketing, products, engineering, and analytics. We are looking for a data-focused technologist with experience driving a marketing technology stack to support high growth initiatives. As a member of the Marketing Data and Technology team, you will play a key role in building scalable consumer marketing programs by working across the organisation with the Growth & Analytics, Product Marketing, and Engineering teams. You will power how Marketing comes to life at property finder by managing and integrating 1st party data, tracking and configurations, developing data flows, and shipping web or app based solutions.\n\nKey Responsibilities\n\n\n * Manage and optimise our marketing technology stack, including tools like Tealium CDH, Splitio, Braze, Google Analytics,firebase, kochava/Adjust , Instapage, supermetrics, zapier, GTM etc.\n * Integrate data from various sources into our martech stack, ensuring data accuracy, consistency, and accessibility.\n * Design and implement automated workflows to streamline processes and improve efficiency.\n * Develop and implement marketing attribution models to accurately measure the impact of marketing efforts on business outcomes.\n * Provide training and support to marketing teams on martech tools, best practices, and techniques to enhance their effectiveness and efficiency.\n * Troubleshoot technical issues with martech tools and ensure their smooth operation. Stay updated on new tool features and updates to optimise their usage.\n * Ensure effective implementation of martech solutions to help achieve marketing goals.\n * Establish clear definitions for accurate and complete data across all touchpoints in the Martech stack.\n * Regularly monitor data quality metrics (e.g., missing values, inconsistencies, duplicates) and implement processes to identify and address data quality issues promptly.\n * Create detailed maps and documentation outlining how data flows through the martech stack, identifying data sources, transformations, and destinations.\n * Manage and validate JavaScript tags and image pixels to ensure proper data tracking\n * Analyze data from marketing technology systems to derive actionable insights.\n * Collaborate within the cross-functional teams to gather requirements, provide technical guidance, and deliver analytics solutions that meet business objectives\n   \n   \n\nThe Person\n\nDesired Qualifications\n\n\n * Minimum 6+ years of experience in marketing technology Stack\n * Proficiency in marketing platforms, automation, analytics tools, and data integration solutions.\n * Strong analytical skills with the ability to interpret data, identify inconsistencies, errors, and flow issues, and then develop solutions to address them.\n * Ability to structure and implement / improve / manage QA and testing processes.\n * Strong understanding of APIs, data integration, and data pipelines and logical flows across different systems within Marketing Stack.\n * Excellent communication and collaboration skills, with the ability to work cross-functionally with marketing and tech teams.\n * Detail-oriented with a focus on accuracy and quality in data management and analysis.\n * Ability to thrive in a fast-paced, dynamic environment and adapt to changing priorities and requirements.\n * Super detail-oriented and meticulous with work.\n * Highly analytical with good problem-solving skills.\n * Excellent relationship management skills, with a proven track-record of managing cross functional resources and influencing stakeholders.\n * Strong time management & prioritisation skills.\n * Self-motivated and excited to work on different projects.\n * Must be fluent in SQL , Javascript, Browser & App\n * Stay on top of latest innovations in the Marketing domain in areas such as Data, Data Policy, systems including DMP/CDP, composable architectures, generative AI and ML\n * Qualification - Bachelor’s degree in Computer Science/B.E./B.Tech/MCA/MS/Other Graduation\n * Excellent interpersonal, presentation, and communication skills\n   \n   \n\nOther Capabilities\n\nPersonal Attributes\n\n\n * Proactive. You believe it’s always on you to ensure that anything you do is a success.\n * In love with a challenge. You revel in solving problems and want a job that pushes you out of your comfort zone.\n * Goal-oriented. You’re incredibly ambitious. You’re dedicated to a long-term vision of who you are and where you want to go.\n * Open to change. You’re inspired by the endless ways in which everything we do can always be improved.\n * Calm under pressure. You have a sense of urgency but channel it into productively working through any issues.\n * Super attentive to detail. You have an eagle’s eye for detail and can catch any mistake within seconds\n * Ability to ‘self-start’ and be able to work and plan independently to achieve business outcomes without specific direction\n   \n   \n\nOur promise to talent\n\nWe encourage our people, called creators, to move fast, to be bold and offer them countless ways to make an impact in a fast-growing and talent-centric organisation.\n\nOur goal is to ensure that our people find their time at Property Finder a rewarding experience where the company’s growth also means personal growth.\n\nOverall it is a place for you to be your best self.\n\nProperty Finder Principles\n\n\n * Move fast and make things happen\n * Data beats opinions\n * Don’t confuse motion with progress\n * Failure is success if we learn from it\n * People over pixels\n   \n   \n\nFind us at:\n\nTwitter\n\nFacebook\n\nInstagram\n\nLinkedin\n\nGlassdoor",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Other",
  "sector": "Technology, Information and Internet",
  "applyType": "EASY_APPLY",
  "applyUrl": "https://ae.linkedin.com/jobs/view/senior-martech-manager-at-property-finder-3927701414?trk=public_jobs_topcard-title",
  "companyId": "2255537",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Agency Partnerships Manager - METAP",
  "jobUrl": "https://ae.linkedin.com/jobs/view/agency-partnerships-manager-metap-at-tiktok-3926954293?trk=public_jobs_topcard-title",
  "companyName": "TikTok",
  "companyUrl": "https://www.linkedin.com/company/tiktok?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Responsibilities\n\nAgency Partner -Dubai\n\nAbout Us:\nTikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Singapore, Jakarta, Seoul and Tokyo.\n\nWhy Join Us:\nCreation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible.\nTogether, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day.\nTo us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always.\nAt TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve.\nJoin us.\n\nTeam:\nOur Agency Partnership team is responsible for building long term partnerships with the top agencies and brands across the Middle East, to educate and inform them about commercial opportunities within TikTok. Our innovative advertising products are high-impact and engaging, we create a native experience for our users and develop deep connections with our brands.\n\nResponsibilities:\n- Have a consultancy mindset while engaging with Performance, Social and Full-service agency teams across the GCC region\n- Facilitate a Top-Down enablement of the agency\n- Build on the depth of business by activating dormant accounts\n- Forecasting to a high level of accuracy on the business on an account level\n- Provide agencies with the highest level of customer service\n- Ensure product and platform expertise at an agency level through various onboarding, education, and workshop sessions.\n- Develop agency first programs to evangelize the use of TikTok within these agencies\n- Build relationships with senior agency staff and identify avenues of enhanced partnership\n- Grow the eco-system by signing new agencies onboard\n- Engage with internal Bytedance teams - Brand Strategy, Creative, Client Partner, Mid-Market teams as needed to create cross team collaborations from the inside out\n- Manage and grow primary agency relationships including media planners and buyers.\n- Optimize growth through strategic agency-wide projects.\n\nQualifications\n\nMinimum Qualifications:\n-Professional experience working with media agencies or digital sales house, and a keen understanding of independent agencies\n- A proven track record of leading and winning business\n- The ability to independently manage a book of business\n- Demonstrated experience in working with cross-functional teams\n\nPreferred Qualifications:\n- Creative, outside-the-box thinker and strategist\n- Excellent communication and presentation skills-A team player and collaborator\n- Ability to perform well in a fast paced, rapidly changing environment\n- Ability to travel domestically and internationally as needed\n\nTikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Sales, Business Development, and Marketing",
  "sector": "Entertainment Providers",
  "applyUrl": "https://careers.tiktok.com/position/7367284353104120091/detail?spread=5MWH5CQ",
  "applyType": "EXTERNAL",
  "companyId": "33246798",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Sr. Manager Procurement",
  "jobUrl": "https://ae.linkedin.com/jobs/view/sr-manager-procurement-at-talabat-3926971068?trk=public_jobs_topcard-title",
  "companyName": "talabat",
  "companyUrl": "https://ae.linkedin.com/company/talabat-com?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "About The Opportunity\n\nRole Summary\n\nThis role will manage end to end procurement support on a range of complex procurement activities, managing, negotiating, playing a key role for procurement team and delivery of procurement sourcing strategies within the designated categories of expenditure.\n\nWhat’s On Your Plate?\n\n\n * Reviewing the current procurement policies with alignment with DH policies and planning the procedures for efficiently, honestly, economically and productively purchasing goods.\n * Perform integrate supplier performance management with Supply Quality to ensure continuity of supply through risk mitigation and Supplier Development activities\n * Monitor supplier performance to assess ability to meet quality and delivery requirements through the scorecard evaluation process\n * Develop key performance indicators to monitor supplier performance, inventory turn objectives and continuity of supply planning\n * Demonstrated expertise in supply chain functions: material planning, master scheduling, production control, inventory management and inventory disposition\n * Developed and implemented a corporate supply chain strategy to safeguard long-term supply, assure access to technology and ongoing cost-competitiveness\n * Monitoring, reviewing and analyzing bids and quotes with suppliers, including the negotiation of service agreements and contracts\n * Achieved targeted improvements in quality, cost, delivery, responsiveness and supply chain flexibility\n * Maintaining company overall procurement budget and streamlining costs and define reporting processes for total company spend by product category and business functions.\n * Managed supplier relationships to ensure a fair competitive environment and maximum utilization throughout the supply chain\n   \n   \n\nWhat Did We Order?\n\n\n * Bachelor’s Degree\n * Solid knowledge and understanding of procurement processes, policy, and ERP systems\n * 6-10 years’ Experience in Procurement, Supply Chain Management.\n * Strong analytical skills to ensure both short- and long-term business goals, objectives, and targets are met\n * Ability to negotiate, establish, and administer contracts\n * Excellent verbal and written communication skills\n * Accuracy and precise attention to detail\n * Ability to work with management and staff at all levels\n   \n   \n\nWhat you need to be successful\n\nWhat Did We Order?\n\n\n * Bachelor’s Degree\n * Solid knowledge and understanding of procurement processes, policy, and ERP systems\n * 6-10 years’ Experience in Procurement, Supply Chain Management.\n * Strong analytical skills to ensure both short- and long-term business goals, objectives, and targets are met\n * Ability to negotiate, establish, and administer contracts\n * Excellent verbal and written communication skills\n * Accuracy and precise attention to detail\n * Ability to work with management and staff at all levels\n   \n   \n\nWho we are\n\nAs the region’s leading local tech organization, we’re proud to say that we have been delivering for millions of people right across MENA for the past 18 years.\n\nWe were founded in Kuwait in 2004, and acquired by Delivery Hero (DHER) in 2015. This gives us a unique outlook - local knowledge with global expertise. It also allows us to innovate, create, and bring new technologies for the betterment of the MENA region, such as q-commerce, sustainable packaging, cloud kitchens, autonomous delivery vehicles, robots, and drones.\n\nWe deliver across 9 countries with more than 4,500+ employees! Our food delivery business works with over 27,000 brands and almost 50,000 branches.\n\nOur q-commerce concept, talabat mart (121 Stores), now delivers groceries to customers in Bahrain, Iraq, Egypt, Jordan, Kuwait, Oman, Qatar, and the UAE in 30 minutes or less!\n\ntalabat is part of the Delivery Hero Group, the world’s leading local delivery platform operating in 70+ countries worldwide",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Purchasing and Supply Chain",
  "sector": "Technology, Information and Internet",
  "applyUrl": "https://careers.deliveryhero.com/job/sr-manager-procurement-in-dubai-uae-jid-1488?_atxsrc=Linkedin&utm_source=Linkedin&source=LinkedIn",
  "applyType": "EXTERNAL",
  "companyId": "3604171",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Trainer - Contact Center ( Bilingual - English/ Arabic )",
  "jobUrl": "https://ae.linkedin.com/jobs/view/trainer-contact-center-bilingual-english-arabic-at-concentrix-3928678533?trk=public_jobs_topcard-title",
  "companyName": "Concentrix",
  "companyUrl": "https://www.linkedin.com/company/concentrix?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Job Title:\n\nTrainer - Contact Center ( Bilingual - English/ Arabic )\n\nJob Description\n\nThe Trainer I is responsible for delivering client focused training to address the new hire, product update and recursive training requirement of Concentrix in support of client programs to ensure superior workforce preparation with best in class service and delivery. This position requires attaining and maintaining certification in the Trainer Certification Program (101/102), provides mentoring to Program Ready Trainers, curriculum review and modification as needed, and evaluation of training programs using various feedback methods.\n\nEssential Functions/Core Responsibilities\n\n\n * Responsible for day-to-day functional direction of agents within the program training classroom environment, including student progress monitoring for the duration of training, providing coaching and developmental feedback and readiness recommendations\n * Utilize effective presentation and facilitation skills including creative training techniques and adult/accelerated learning techniques using a variety of training delivery modalities in a classroom environment\n * Prepare and present training materials through classroom learning, hands on demonstrations, and supporting activities\n * Accountable for achieving individual training performance metrics\n * Support and partner with Operations to transition of agents from training to production environment, ensuring competency levels meet business needs (where required)\n * Maintain relevant product knowledge for each account by taking calls, attending client and cross functional meetings (as needed), and side by side observations\n * Ensure effective, consistent communication with managers, peers, and other resource groups, including day-to-day informal interaction with clients\n * May support Instructional Design team in designing and developing training materials for various instructional delivery methods including; computer-based training, interactive, classroom training, and written job aids\n * Measure the effectiveness of training programs using various feedback methods – focus groups, interviews, and surveys that will lead to enhancement of training resources and programs based on results of evaluation\n * Recommend curriculum modifications to Training Manager/Supervisor on the basis of internal customer feedback and/or Training Needs Analysis\n * Participate and contribute to continuous learning culture by maintaining engagement on change management, product and services releases, policies, processes, and procedures\n   \n   \n\nCandidate Profile\n\n\n * Bachelor's Degree in related field from a four-year college or university with two to four years of relevant experience preferred\n * A bilingual English (B2+ level) and native Arabic speaker.\n * Proven experience in training methodologies, and soft skills (communication skills, critical thinking, time management, team building, etc.)\n * Strong communication skills, both written and verbal\n * Proficient in Microsoft Office\n * Demonstrated ability to multi-task, prioritize, and meet timelines on deliverable\n * Self-starter, sense of urgency, and works well under pressure\n * Strong attention to detail\n * Sense of professionalism and ability to develop good relationships\n   \n   \n\nCareer Framework Role\n\nRequires knowledge and experience in own discipline; still acquiring higher level knowledge and skills\n\nAnalyzes possible solutions using standard procedures and principles\n\nBuilds knowledge of the organization, processes and customers Solves a range of straightforward problems\n\nReceives a moderate level of guidance and direction\n\nDisclaimer\n\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties, and skills required of personnel working within this job title.\n\nConcentrix is an equal opportunity employer. Concentrix evaluates qualified applicants without regard to race, color, religion, gender, national origin, age, sexual orientation, gender identity or expression, protected veteran status, disability status or any other legally protected characteristic.\n\nLocation:\n\nARE Dubai - Property# BCB2 515, Dubai CommerCity\n\nLanguage Requirements:\n\nTime Type:\n\nIf you are a California resident, by submitting your information, you acknowledge that you have read and have access to the Job Applicant Privacy Notice for California Residents\n\nR1499759",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Education and Training",
  "sector": "IT Services and IT Consulting",
  "applyUrl": "https://apply.concentrix.com/global/en/job/CONCGLOBALR1499759EXTERNALENGLOBAL/Trainer-Contact-Center-Bilingual-English-Arabic?utm_source=linkedin&utm_medium=phenom-feeds",
  "applyType": "EXTERNAL",
  "companyId": "23213",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Senior Resident Engineer",
  "jobUrl": "https://ae.linkedin.com/jobs/view/senior-resident-engineer-at-barq-systems-3981571594?trk=public_jobs_topcard-title",
  "companyName": "BARQ Systems",
  "companyUrl": "https://sa.linkedin.com/company/barqsystems?trk=public_jobs_topcard-org-name",
  "location": "Dubai, United Arab Emirates",
  "postedTime": "5 hours ago",
  "applicationsCount": "29 applicants",
  "description": "BARQ Systems , UAE Office is currently hiring an “ Senior Resident Engineer ” with the below qualifications.\n\n\n\n\nQualifications:\n\n * Bachelor’s degree in computer science, Information Technology, or related field.\n * Proven experience in designing, implementing, and supporting wireless networking solutions in enterprise environments.\n * Strong understanding of network protocols, including TCP/IP, DNS, DHCP, and VLANs.\n * In-depth knowledge of wireless standards (e.g., 802.11ac, 802.11ax) and wireless security protocols (e.g., WPA2, WPA3).\n * Experience with Network Access Control (NAC) solutions, such as Cisco ISE, Aruba ClearPass, or similar platforms.\n * Solid understanding of network security principles and best practices, including encryption, authentication, and access control mechanisms.\n * Excellent analytical and problem-solving skills, with the ability to troubleshoot complex technical issues independently.\n * Effective communication and interpersonal skills, with the ability to interact professionally with clients and collaborate with internal teams.\n * Have experience with one or more the below solutions:\n\nMandatory:\n\nAruba NAC solution: ClearPass\n\nAruba Wireless solutions : ( Aruba OS 8 architecture , Aruba OS 10 Architecture)\n\nAruba and HPE : Switching( HPE switches, Aruba OS switches, Aruba CX switches)\n\nOptional\n\nFirewall Technologies: FortiGate & Paloalto & Forcepoint\n\n\n\n\nCertifications (Preferred):\n\nAruba certified mobility Expert/Professional. (ACMX) (ACMP/ACP)\n\nAruba Certified ClearPass Professional/Expert. (ACCP)(ACCX)\n\nAruba Certified Design professional (ACSP).\n\nAruba Certified switching professional(ACSP).\n\n\n\n\nCertifications (OPTIONAL):\n\nFirewall profession certification (Palo alto, Fortinet)\n\n\n\n\nJob Role:\n\n * Conduct demos/proof of concept setups to convince the customer with the product to make the customer issue the PO\n * Design, configure, and deploy wireless networks, including access points, controllers, and associated infrastructure components.\n * \n * Develop and implement Network Access Control (NAC) solutions to enforce security policies and control access to network resources.\n * \n * Conduct site surveys and assess network requirements to ensure optimal performance and coverage using Ekahau tool.\n * \n * Troubleshoot and resolve technical issues related to wireless and NAC systems, including performance bottlenecks, connectivity issues, and security incidents.\n * \n * Collaborate with cross-functional teams, including network engineers, security analysts, and project managers, to deliver integrated solutions that meet client requirements.\n * \n * Stay abreast of emerging technologies and industry trends in wireless networking and network security to continuously improve service offerings and best practices.\n * Responsible for providing support service (after sales service) for customers who has active contracts\n * should possess strong troubleshooting skills to effectively manage advanced scenarios.\n * Develop low level design & as built manual to document installation activities & provide it to customer.\n * Troubleshoot product deficiencies with vendor (Technical Assistance Center) through set of SLAs to resolve customer complain\n * Report Lab /POC/installation activities visits internally/externally.( Quality Assurance)\n * Conduct technical/hands on training to customers\n\n\n\n\nIf interested, kindly send your CV to talent.acquisition@barqsystems.com , mentioning in the Subject “Senior Resident Engineer”",
  "contractType": "Full-time",
  "experienceLevel": "Entry level",
  "workType": "Engineering and Information Technology",
  "sector": "IT Services and IT Consulting",
  "applyType": "EASY_APPLY",
  "applyUrl": "https://ae.linkedin.com/jobs/view/senior-resident-engineer-at-barq-systems-3981571594?trk=public_jobs_topcard-title",
  "companyId": "5077620",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Category Manager - Color Cosmetics - Faces",
  "jobUrl": "https://ae.linkedin.com/jobs/view/category-manager-color-cosmetics-faces-at-chalhoub-group-3943880773?trk=public_jobs_topcard-title",
  "companyName": "Chalhoub Group",
  "companyUrl": "https://ae.linkedin.com/company/chalhoubgroup?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "INSPIRE | EXHILARATE | DELIGHT\n\nFor over six decades, Chalhoub Group has been a partner and creator of luxury experiences in the Middle East. The Group, in its endeavour to excel as a hybrid retailer, has reinforced its distribution and marketing services with a portfolio of eight owned brands and over 300 international brands in the luxury, beauty, fashion, and art de vivre categories. More recently, the Group expanded its expertise into new categories of luxury watches, jewellery, and eyewear.\n\nEvery step at Chalhoub Group is taken with the customer at heart. Be it constantly reinventing itself or focusing on innovation to provide luxury experiences at over 750+ experiential retail stores, online and through mobile apps, each touch point leads to delighting the customer.\n\nToday, Chalhoub Group stands for 14,000 skilled and talented professionals across seven countries, whose cohesive efforts have resulted in the Group being ranked third in the Middle East and first in Saudi Arabia as a Great Place to Work®.\n\nTo keep the innovation journey going, the Group has set up “The Greenhouse”, which is not just an innovation hub, but also an incubator space and accelerator for start-ups and small businesses in the region and internationally. This is just one of the several initiatives taken by the Group to reinvent itself, catalysed by forward thinking and future-proofing. The Group has also been embedding sustainability at the core of its business strategy with a clear commitment towards people, partners and the planet, and by being a member of the United Nations Global Compact Community and signatory of the Women's Empowerment Principles.\n\nWhat You'll Be Doing\n\nOur Category Manager based in the UAE would look after Faces regionally and is responsible for defining and driving the “offer” and purchasing strategy for different product categories and brands. The Category Manager is also responsible for defining the action plan for the categories, merchandising, promotional activities, prices, and negotiations.\n\nResponsibilities\n\n\n * Develop the business plan of the category in line with the strategic objectives of Faces.\n * Formulate and communicate the category performance objectives and continuously monitor progress and alignment toward strategic objectives.\n * Negotiate annual commercial agreements and the commercialization of advertising spaces with the brands.\n * Takes ownership of gross margins & drives an optimal category mix to influence growth.\n * Benchmark current performance vs. the competition and the peer market\n * Create different tools to improve the categories’ performance\n * Handle the production of the annual calendar for the brands promotions, launches, etc.\n * Assess the requirements and coordinate with relevant internal/external stakeholders (Marketing, Visual Merchandising, Suppliers, Category Managers and Logistics)\n * Negotiate with suppliers for the stock returns (discontinued and slow movers)\n * Analyses and helps interpret trends pertaining to the market, competitors, customers & partners, and uses.\n * Assists in building a competitive assortment, keeping in mind market and competition trends\n * Focus on core categories and new categories/ brands to work on a holistic assortment.\n * Works closely with internal functions like a supply chain for inventory management & managing the buying budget, marketing for the promotional calendar, sales operations for driving key initiatives/novelties and e-commerce team in ensuring that the assortment is in line with offline to drive omnichannel retailing.\n * Drives team to maximize additional income for the organization through initiatives like space selling (animation)\n * Ensures that the commercial teams drive new launches, new categories or new brands/ initiatives successfully.\n * Addresses commercial escalations both internal and external.\n * Assortment and Lifecycle Management (depending on defined KPIs)\n * Store Profitability\n * Listing and De-Listing decisions\n * Development, Sourcing, and Implementation of new Assortment Concepts, Trends, and Brands.\n * Competitive Benchmarking\n * Supplier Management & Negotiations\n * Purchasing Meetings and first-order responsibilities\n * Limit (OTB) and Inventory (shared responsibility w/ supply chain)\n * COOP, JBP Negotiation\n * Build and negotiate an activation plan for the Category\n * Intersection cross-department to Marketing, E-Com, Finance, Logistics, Retail Teams\n * Ongoing feedback and exchange with the Retail Team\n   \n   \n\nWhat You’ll Need To Succeed\n\n\n * A minimum of 5 years in a commercial role within the retail sector or a leadership role within category management.\n * Demonstrated expertise in P&L management, showcasing the ability to drive financial performance and operational efficiency.\n * Offline Beauty Retail category management experience is a must, however online experience is a plus.\n * Adaptable and passionate about colour cosmetics market trends and brands.\n * Proficiency in managing stakeholders and fostering partnerships, with a track record of successful business development.\n   \n   \n\nWhat We Can Offer You\n\nWith us, you will turn your aspirations into reality. We will help shape your journey through enriching experiences, learning and development opportunities and exposure to different assignments within your role or through internal mobility. Our Group offers diverse career paths for those who are extraordinary, every day.\n\nWe recognise the value that you bring, and we strive to provide a competitive benefits package which includes health care, child education contribution, remote and flexible working policies as well as exclusive employee discounts.\n\nWe Invite All Applicants to Apply\n\nIt Takes Diversity Of Thought, Culture, Background, Differing Abilities and Perspectives to truly Inspire, Exhilarate and Delight our customers. At Chalhoub Group, we are committed to inclusion and diversity.\n\nWe welcome all applicants to apply and be part of our exciting future. We ensure equal opportunity for all our applicants without regard to gender, age, race, religion, national origin or disability status.",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Marketing and Sales",
  "sector": "Retail Luxury Goods and Jewelry",
  "applyUrl": "https://careers.chalhoubgroup.com/jobs/4494387-category-manager-color-cosmetics-faces",
  "applyType": "EXTERNAL",
  "companyId": "950185",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Sr. Manager Operations - Local Shops",
  "jobUrl": "https://ae.linkedin.com/jobs/view/sr-manager-operations-local-shops-at-talabat-3945200556?trk=public_jobs_topcard-title",
  "companyName": "talabat",
  "companyUrl": "https://ae.linkedin.com/company/talabat-com?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "About The Opportunity\n\nRole Summary\n\nWe’re looking for a Senior Operations Manager to join the team and focus on growing our Local shops business, which is the region’s biggest grocery aggregator enabling millions of consumers to order and get products from their favorite stores delivered to their homes.\n\nWhat’s On Your Plate?\n\n\n * Managing the full operations end to end (team operations, 3pl management, vendor management, picker management, property/asset management, operational standards, expense control).\n * Stock management: Ensure correct processes, policies and proper management of store data to ensure only products available in the store are present on the app.\n * Picker process: Ensure efficient and correct pick and pack process and service level (picking up the correct item/quantity) & proper management of the staffing and scheduling as per demand to achieve desired UTR and service level.\n * 3PL personal management: hiring and managing strong 3PL partners who provide and manage manpower to improve our overall in-store operations.\n * Property / Asset Management: Proper management of the property and facility, plus asset management and tracking.\n * Expense Control: Identify potential opportunities to reduce expenses with the same operational efficiency.\n * Managing Productivity, work standards, and development of store staff.\n * Monitoring and managing the store costs VS budget for the section.\n * Ensuring continuous improvement of current performance VS accepted standard/best practices at the store (i.e. stock level, productivity, service level).\n * Monitoring the financial and operational performance of each store and initiating required actions for improvement.\n * Controlling and ensuring that equipment, infrastructure, etc. in stores are used and maintained properly.\n * Developing action plans with the department manager to address weak areas in need of improvement.\n * Instituting training and developmental programs for staff and monitoring effective implementation.\n * Monitoring product range availability according to selected store product range.\n * Develop preventive and regular maintenance plans.\n   \n   \n\nWhat Did We Order?\n\n\n * You have at least 10+ years of experience in progressive development and management of multiple product categories, matured by working for large retailers, in an international setting. If you have worked for a fulfilment, operations, e-commerce, FMCG retail business it is a plus.\n * You have built teams and led cross-functional projects at scale.\n * You are very detail-oriented, structured, and know how to prioritize -- you consider yourself as someone who delivers solutions and not bottlenecks to be solved.\n * You are able to interact with senior-level executives and can manage the expectations of multiple stakeholders.\n * You are someone energized by the unknown and look forward to learning each day on the job.\n * You have excellent analytical and communication skills, and always like to be hands-on with several tools.\n * Additionally, you have robust interpersonal and intercultural skills. You can inspire several teams and stakeholders to rally behind a mission.\n * Language skills: Fluent English and Arabic would be highly advantageous.\n   \n   \n\nWho we are\n\nAs the region’s leading local tech organization, we’re proud to say that we have been delivering for millions of people right across MENA for the past 18 years.\n\nWe were founded in Kuwait in 2004, and acquired by Delivery Hero (DHER) in 2015. This gives us a unique outlook - local knowledge with global expertise. It also allows us to innovate, create, and bring new technologies for the betterment of the MENA region, such as q-commerce, sustainable packaging, cloud kitchens, autonomous delivery vehicles, robots, and drones.\n\nWe deliver across 9 countries with more than 4,500+ employees! Our food delivery business works with over 27,000 brands and almost 50,000 branches.\n\nOur q-commerce concept, talabat mart (121 Stores), now delivers groceries to customers in Bahrain, Iraq, Egypt, Jordan, Kuwait, Oman, Qatar, and the UAE in 30 minutes or less!\n\ntalabat is part of the Delivery Hero Group, the world’s leading local delivery platform operating in 70+ countries worldwide",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Management and Manufacturing",
  "sector": "Technology, Information and Internet",
  "applyUrl": "https://careers.deliveryhero.com/job/sr-manager-operations-local-shops-in-dubai-uae-jid-1735?_atxsrc=Linkedin&utm_source=Linkedin&source=LinkedIn",
  "applyType": "EXTERNAL",
  "companyId": "3604171",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Head of Legal (Middle East and Africa)",
  "jobUrl": "https://ae.linkedin.com/jobs/view/head-of-legal-middle-east-and-africa-at-trinasolar-3979846130?trk=public_jobs_topcard-title",
  "companyName": "Trinasolar",
  "companyUrl": "https://cn.linkedin.com/company/trina-solar?trk=public_jobs_topcard-org-name",
  "location": "Dubai, United Arab Emirates",
  "postedTime": "9 hours ago",
  "applicationsCount": "Over 200 applicants",
  "description": "About the Company:\n\nFounded in 1997, Trina Solar is the world-leading PV and smart energy total solution provider. On 10 June 2020, Trina Solar issues first A-Shares on Shanghai Sci-Tech Innovation Board, becomes the first PV product, PV system and smart energy company listed on the Shanghai Stock Exchange Science and Technology Innovation Board. Today, Trina Solar is actively accelerating its pace of globalization and the development of its global management team.\n\n\n\n\nDescription of Key Job Duties:\n\n * Responsible for the establishment of overseas factory and risk management of product sales contracts in the Middle East and Africa region, provide legal support for large or complex bilingual (Chinese and English) contracts, assist and guide business negotiations to facilitate signing.\n * Regional risk management and provide strategic advice to business management, prevent potential risks in various commercial transactions in the early stages, lead the proper resolution of company litigation or disputes in later stages, and maximize loss avoidance for the company.\n * Provide legal support for overseas affairs at the group level across regions or business units (BUs), collaborate with other regions or departments of the group to handle specific, sensitive, or complex overseas legal matters or disputes.\n * Supervision and cost control of external lawyers: Select competent external lawyers for different jurisdictions and types of legal matters, control costs, and supervise the quality of external lawyers' work.\n * Team empowerment: Enhance the professional skills of the legal team in the region, closely interact and cooperate with the business team, and provide necessary support and training.\n * Process empowerment: Provide professional advice for the update of company system documents, contract templates, and process optimization.\n * Compliance management: Provide policy or strategic advice for the company’s compliance affairs, support company system documents, and offer relevant legal compliance training for overseas business.\n * Other daily legal support tasks for the company.\n\n\n\n\nSkills Requirement:\n\n * Full-time bachelor’s degree or above, graduated in a related legal field, law firm experience preferred.\n * Passed the Judicial Examination or National Unified Legal Professional Qualification Examination.\n * Over 10 years of legal management experience, familiar with specific overseas regional laws.\n * Fluent in English and Chinese as a working language, to liaise with Chinese counterparties.\n * Experience in overseas factory/base construction, and willing to accept expatriation or frequent business trips.\n\n\n\n\nApplication Process:\n\nIf this is the opportunity you have been waiting for and you fit what we looking for, we welcome your application. The application process involves submitting your current resume via Linkedin’s easy apply or e-mail to apac_career@trinasolar.com\n\n\n\n\n*Please note that only shortlisted candidates will be notified.\n\n",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Legal",
  "sector": "Renewable Energy Semiconductor Manufacturing",
  "applyType": "EASY_APPLY",
  "applyUrl": "https://ae.linkedin.com/jobs/view/head-of-legal-middle-east-and-africa-at-trinasolar-3979846130?trk=public_jobs_topcard-title",
  "companyId": "696485",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Head of Operations / General Manager (SaaS / Fintech/ Credit risk)",
  "jobUrl": "https://ae.linkedin.com/jobs/view/head-of-operations-general-manager-saas-fintech-credit-risk-at-discovered-mena-3979483603?trk=public_jobs_topcard-title",
  "companyName": "Discovered MENA",
  "companyUrl": "https://ae.linkedin.com/company/discovered-mena?trk=public_jobs_topcard-org-name",
  "location": "Dubai, United Arab Emirates",
  "postedTime": "13 hours ago",
  "applicationsCount": "Over 200 applicants",
  "description": "Head of Operations / General Manager\n\n\n\n\nOur client is at the forefront of transforming the debt collection industry through innovative, technology-driven solutions. As they expand their operations in the UAE, they are seeking a Head of Operations / General Manager with a strong background in credit risk and collections, using a modern digital mindset and product understanding.\n\n\n\n\nAs the Head of Operations/ GM you will lead there operations, strategy, and business development efforts in the region. This role requires a unique blend of traditional credit risk and collections expertise with a keen understanding of digital products and the fintech landscape.The ideal candidate will drive the client growth, operational excellence, and product innovation\n\nwithin the UAE market.\n\n\n\n\nKey Responsibilities:\n\n * Strategic Leadership: Develop and execute strategic plans to expand presence and operations in the UAE.\n * Operations Management: Oversee daily operations, ensuring efficiency, quality, and compliance with local regulations.\n * Business Development: Identify and pursue new business opportunities, partnerships, and collaborations with financial institutions and other relevant entities.\n * Team Leadership: Build, mentor, and lead a high-performing team to achieve business objectives.\n * Credit Risk and Collections: Apply extensive knowledge in credit risk management andcollections to enhance our product offerings and operational strategies.\n * Product Development: Work closely with the product team to tailor solutions to the UAE market, ensuring they meet local needs and compliance requirements.\n * Customer Relations: Establish and maintain strong relationships with clients, stakeholders, and regulatory bodies.\n\n\n\n\nSkills and experience\n\n * 10 years proven experience in credit risk management, collections, debt recovery in the UAE.\n * Strong understanding of digital products and the fintech ecosystem.\n * Exceptional leadership skills with experience in building and managing teams.\n * Solid background in business development, with a track record of growing operations and revenue\n\n\n\n\nIn return the client is offering a salary of 35-50k AED DOE, bonus and equity.\n\n",
  "contractType": "Full-time",
  "experienceLevel": "Executive",
  "workType": "Finance",
  "sector": "Financial Services",
  "applyType": "EASY_APPLY",
  "applyUrl": "https://ae.linkedin.com/jobs/view/head-of-operations-general-manager-saas-fintech-credit-risk-at-discovered-mena-3979483603?trk=public_jobs_topcard-title",
  "companyId": "10973412",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Designer - Handbags & Accessories",
  "jobUrl": "https://ae.linkedin.com/jobs/view/designer-handbags-accessories-at-apparel-group-3943860517?trk=public_jobs_topcard-title",
  "companyName": "Apparel Group",
  "companyUrl": "https://ae.linkedin.com/company/apparel-fzco?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Job Description\n\n\n * Create and present the trend forecast followed by line presentations.\n * Planning and developing new ranges.\n * Working with buyers and forecasters, to develop products to meet a brief.\n * Liaising closely with buying and planning teams on an ongoing basis to ensure the item suits the customer, market and price points.\n * Keeping up to date with emerging fashion trends as well as general trends relating to PU, colors and quality and technical parameters\n * Should have experience of sourcing the samples made from factories and should have deep understanding of Pricing along with the product.\n * Knowledge of Leather for working on men’s accessories\n * Should be well versed in submitting the required touchbacks with all technical specifications to the factories. Understanding design from a technical perspective.\n * Should be able to locate factories for production across many regions.\n * Trainings should be imparted on the product to the front end along with the buyers\n * Well versed in latest designing software (Illustrator, Photoshop etc.).\n * Readiness to multitask and should have a proactive approach. Knowledge of working on excel to take out the sell thru rate will be beneficial.",
  "contractType": "Full-time",
  "experienceLevel": "Entry level",
  "workType": "Design, Art/Creative, and Information Technology",
  "sector": "Retail",
  "applyUrl": "https://ediu.fa.em2.oraclecloud.com/hcmUI/CandidateExperience/en/job/5311/?utm_medium=jobshare",
  "applyType": "EXTERNAL",
  "companyId": "326706",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Garments Merchandiser Required In ABROAD",
  "jobUrl": "https://ae.linkedin.com/jobs/view/garments-merchandiser-required-in-abroad-3979483343?trk=public_jobs_topcard-title",
  "companyName": "",
  "companyUrl": "",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "13 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Call WhatsApp To Ms.Neha-9870170629\n\n\n * Product development and price offer to the client.\n * Price confirms with the client and provides PI to the client for master L/C.\n * Within a short time to collect all order concern document to the buyer for necessary action.\n * Collect PI for open BTB L/C to arrange the all related materials.\n * To follow-up T A on a regular basis to ensure on-time delivery with the right quality and quantity.\n * Lab dip, trims, bulk fabric color, and quality submit to the buyer for approval.\n * Arrange all materials to make the required\n * Closely monitoring the sampling approval process and on-time provide to the client for approval and arrange approval for the go-ahead.\n * Critical path analyzes and meeting with the buyer.\n * PP meetingwith the buyer.\n * Size set submits to the buyer and arranges approval for bulk production.\n * To in-house require materials on time to production according to T A.\n * To collect an inventory report from the store.\n * Update factory production and the quality team about every message of buying a house\n * Sent the required materials (trims, fabric, etc.) third-party test and provide the report to the client.\n * Regular basis checks with the quality department and makes ensure correct quality.\n * Make a schedule for inspection with the buyer inspection team.\n * Space booking to the shipping line and goods handover on time.\n * Confirm on time and smooth shipment to the buyer\n * If in case fail on-time delivery or correct quality than make a decision and discuss with the head of department or high authority and finalized.\n * Time to time reporting to the head of the department\n * Reporting to the high authority in need basis.\n * Send a document for an issue inspection certificate.\n * If in case need than follow up payment issue.\n   \n   \n\nNote: This job is only for ABROAD (Not for INDIA)\n\nThis job is provided by Shine.com",
  "contractType": "Full-time",
  "experienceLevel": "Entry level",
  "workType": "Marketing and Sales",
  "sector": "Staffing and Recruiting",
  "applyUrl": "https://www.shine.com/jobs/garments-merchandiser-required-in-abroad/world-wide-immigration-service-llp/15214934/?utm_source=linkedin-feed&amp;utm_medium=referral&amp;utm_campaign=linkedin-feed&amp;auto_apply=true",
  "applyType": "EXTERNAL",
  "companyId": "",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Sales Exec - Sales Exec - Enterprise Accts",
  "jobUrl": "https://ae.linkedin.com/jobs/view/sales-exec-sales-exec-enterprise-accts-at-entrust-3945638783?trk=public_jobs_topcard-title",
  "companyName": "Entrust",
  "companyUrl": "https://www.linkedin.com/company/entrust?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Career Growth, Flexibility and Collaboration!\n\nEntrust is dedicated to keeping the world moving safely by enabling trusted identities, payments, and data protection around the globe. Headquartered in Minnesota, we offer our colleagues the ability to work globally, in a flexible and collaborative environment. Our team makes an impact!!\n\nThe Company: Entrust relies on curious, dedicated and innovative individuals whom anticipate the future and provide solutions for a more connected, mobile and secure world. Entrust’s technologies and expertise help government agencies, enterprises and financial institutions in more than 150 countries serve and safeguard citizens, employees and consumers.\n\nWe Believe: Securing identities is most effective when we value all identities. We are committed to ensuring that, through diversity and inclusion, the many voices that make up our communities are heard. From unconscious bias training for managers to global affinity groups that create connections both within and across our enterprise, Entrust expects and encourages all individuals to accept and respect one another. And, of course, to be themselves.\n\nPosition Overview\n\nThe role of a Sales Exec - Digital ID Strategic will be based in Dubai with key focus on achieving the assigned sales targets and objectives across the UAE by managing a list of key accounts across the region and maintaining / building a strong relationship within these key accounts, functioning as a single point of contact.\n\nResponsibilities\n\n\n * Takes responsibility and ownership of prospective and existing customers within an assigned territory.\n * Achieving assigned Sales Targets within the assigned region and strategic accounts.\n * Developing strategies to acquire net new business and meet targets for growth while also managing/growing existing key accounts.\n * Developing and delivering value proposition message through a variety of methods (i.e., phone, web, in person etc.) to prospects within an assigned territory.\n * Calls on existing and potential clients to identify their current or perspective needs and provide information about products/services including demonstrations and quotations.\n * Prospects daily to increase wallet share within existing customer base. This prospecting includes leveraging referrals and working with the Channel and Inside Sales\n * Creates and routinely updates a dynamic territory plan, highlighting regional targets, key targets, vertical opportunities, etc.\n * Researches and develops sales presentations to effectively relate products/services to potential customers' needs\n * Maintains thorough knowledge of products/services, sales objectives and strategies, pricing and delivery/installation policies and practices to be able to respond to customer requests for information. Manages overall client relationships, has overall responsibility for the maintenance and development of business from existing clients.\n * Responsible for accurate forecast – maintains required sales and call records and prepares reports as required.\n * Leverages marketing events/activities as well as attending relevant industry events and trade shows to ensure Entrust brand recognition within the marketplace.\n * Is accountable for accurately reporting and documenting all contacts, and engaging in proper and timely follow-up with prospective clients.\n * Ensures the pre-sales endorsement/presentation of Entrust products.\n * Represents the Company at exhibitions, conferences, and speaking engagements to assist in explaining technical and performance information.\n * Works closely with other Sales Executives, Sales Director and RVP.\n   \n   \n\nQualifications\n\n\n * Diploma/Degree or equivalent experience.\n * Multilingual: must be fluent in English + Arabic .\n * Regional experience within the assigned countries (mainly UAE and Qatar).\n * A minimum of 8+ years’ experience in sales , preferably within the Information security space, Digital Identity, Software & Cloud Services by selling complex solutions to senior personnel.\n * New account development experience; awareness of target markets and product offerings of competitors.\n * Account relationship management experience as evidenced by opening, growing and maintaining fortune level accounts.\n * A proven and successful track record of closing key deals and meeting or exceeding targets.\n * Ability to learn our products/services, sales strategies, pricing understanding of security solutions would be a definite asset (PKI , Authentication, encryption, etc.).\n * Strong communication, presentation and sales skills.\n * Strong teaming skills – ability to work cross functionally within the organization.\n * The successful candidate should be highly motivated, possess a flexible attitude to work, be analytical in thinking and have the ability to interact at all levels.\n * Ability to handle frequent travel and the stress of sales.\n   \n   \n\nAbout Entrust\n\nEntrust keeps the world moving safely by enabling trusted identities, payments and data protection around the globe. Today more than ever, people demand seamless, secure experiences, whether they’re crossing borders, making a purchase, or accessing corporate networks. With our unmatched breadth of digital security and credential issuance solutions, it’s no wonder the world’s most entrusted organizations trust us.\n\nFor more information, visit www.entrust.com. Follow us on, LinkedIn, Facebook, Instagram, and YouTube\n\nEntrust Corporation is an EOE/AA/Veteran/People with Disabilities employer.\n\nFor US Roles, Or Where Applicable\n\nEntrust is an EEO/AA/Disabled/Veterans Employer\n\nFor Canadian Roles, Or Where Applicable\n\nEntrust values diversity and inclusion and we are committed to building a diverse workforce with wide perspectives and innovative ideas. We welcome applications from qualified individuals of all backgrounds, and we strive to provide an accessible experience for candidates of all abilities.\n\nIf you require an accommodation, contact accessibility@entrust.com.\n\nRecruiter\n\nNeha Rathore\n\nNeha.Rathore@entrust.com\n\n",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Sales and Business Development",
  "sector": "Software Development",
  "applyUrl": "https://entrust.wd1.myworkdayjobs.com/EntrustCareers/job/United-Arab-Emirates\\u002d\\u002d-Dubai/Sales-Exec\\u002d\\u002d-Sales-Exec\\u002d\\u002d-Enterprise-Accts_R002964?source=LinkedIn",
  "applyType": "EXTERNAL",
  "companyId": "8011",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Country Sales Manager (Lighting Industry) (Lower Gulf)",
  "jobUrl": "https://ae.linkedin.com/jobs/view/country-sales-manager-lighting-industry-lower-gulf-at-confidential-3979476290?trk=public_jobs_topcard-title",
  "companyName": "Confidential",
  "companyUrl": "https://eg.linkedin.com/company/confidentialcompany.com?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "16 hours ago",
  "applicationsCount": "Over 200 applicants",
  "description": "Reports to: Managing Director (MD)\n\nLower Gulf, Mainly UAE - Can Consider Qatar, Bahrain, Kuwait, Oman, and Pakistan\n\nLocation: Dubai\n\n\n\n\nCompany Description:\n\nA leading company in the MENA region, specializing in energy-efficient lighting solutions. This company offers diverse lighting products, including commercial lighting fixtures, residential smart lights, residential lighting fixtures, outdoor floodlights and security lights, light bulbs, and linear tubes.\n\n\n\n\nRole Description:\n\nThe Country Sales Manager for Lower Gulf. will lead the company's sales efforts in the designated geographic area, managing a team of sales representatives, developing and executing sales strategies, and collaborating with cross-functional teams to achieve business objectives. The role focuses on driving revenue growth and increasing market share within the trade sector in this region. A deep understanding of local market dynamics, regulatory environments, and the competitive landscape is essential for effectively positioning the company's products.\n\n\n\n\nKey Responsibilities:\n\n * Develop and implement strategic sales plans to achieve sales targets and expand market presence in the Lower Gulf area.\n * Identify and pursue new business opportunities while maintaining and nurturing existing client relationships.\n * Work with product development and logistics to ensure timely delivery and customer satisfaction.\n * Prepare and present sales forecasts, budgets, and performance reports to the Managing Director regularly.\n * Oversee a sales representative team, set goals and objectives, assign territories and quotas, and monitor performance.\n * Collaborate with marketing, product, and customer service teams to ensure sales efforts align with overall business objectives.\n * Monitor market trends, competitor activities, and customer feedback to identify growth and innovation opportunities.\n * Develop and manage the sales budget, including forecasting and tracking expenses.\n * Ensure timely collection of payments from clients and support the team in managing accounts receivable. Coordinate with finance to monitor outstanding payments and follow up on overdue accounts.\n * Continuously seek to improve the efficiency and effectiveness of the team’s activities in line with the company’s strategic objectives and operational targets.\n * Demonstrate flexibility and a willingness to embrace new challenges, readily accepting additional tasks and responsibilities as directed by the Managing Director.\n * Ensure compliance with relevant laws, regulations, and company policies and procedures.\n * Assess, monitor, manage, and escalate potential risks within assigned areas of responsibility.\n\n\n\n\nQualifications:\n\n * Over 5 years of experience in a sales leadership role within the lighting industry in the designated area.\n * Proven track record of achieving sales targets and driving revenue growth in a competitive market environment.\n * Excellent communication, negotiation, and interpersonal skills.\n * Strong leadership skills with the ability to inspire and motivate a sales team.\n * Strategic thinker with the ability to analyze market data and develop effective sales strategies.\n * Knowledge of local trade regulations, industry standards, and compliance requirements in the regions/countries operating in.\n * Experience managing a sales team, including monitoring and evaluating performance, setting clear objectives, and implementing corrective actions as needed.\n * Strong financial skills to manage budgets, pricing strategies, and profitability analysis for trade sales.\n * Willingness to travel extensively within the assigned region.\n * Fluent in English and Arabic, both written and verbal.\n\n\n",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Sales and Business Development",
  "sector": "Chemical Manufacturing",
  "applyType": "EASY_APPLY",
  "applyUrl": "https://ae.linkedin.com/jobs/view/country-sales-manager-lighting-industry-lower-gulf-at-confidential-3979476290?trk=public_jobs_topcard-title",
  "companyId": "101450980",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Personal Shopper - Threads Styling, Middle East",
  "jobUrl": "https://ae.linkedin.com/jobs/view/personal-shopper-threads-styling-middle-east-at-chalhoub-group-3943880716?trk=public_jobs_topcard-title",
  "companyName": "Chalhoub Group",
  "companyUrl": "https://ae.linkedin.com/company/chalhoubgroup?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "On behalf of Threads Styling, We are looking for Personal Shoppers to join our team in the Middle East.\n\nReporting to our Senior Personal Shopping Manager for the Middle East, our Personal Shoppers will drive the sale of luxury items to a global clientele by being the first port of call for all customer requests.\n\nYou will build, maintain and develop important relationships with your clients to provide the most personal luxury shopping experience possible.\n\nYou are expected to have a client book of regular and loyal clients which you will continue to build and develop.\n\nAs well as your base salary, you will also receive a great commission structure plus bonus. We also have a great Shopper Program for your career development which will allow you to level up as you hit your targets.\n\nAbout Threads\n\nWant to help build the future of luxury fashion commerce? If so, you’ve come to the right place.\n\nThreads is a creative, luxury fashion personal shopping and commerce business. Through social and chat-based media, we inspire our international client base to discover the rarest luxury items. We then search the globe to procure them for our clients; this is the future of retail.\n\nThreads is in Tech City’s Future Fifty programme which recognises some of the UK’s fastest growing businesses, pioneering the best luxury shopping experience in the world!\n\nWhat You'll Be Doing\n\nThe Threads Personal Shopper will be facilitating the sale of luxury items to a global clientele by being the first port of call for customer requests.\n\nYou will build, maintain and develop strong relationships with your clients in order to provide the most personal luxury shopping experience possible.\n\n\n * Talking directly with clients via chat-based media to receive product requests and confirm sales\n * Hold personal shopping appointments domestically and internationally (if required)\n * Connect directly with clients via chat-based media to inspire fashion styling, receive inquiries and sell desired items\n * Build and own your own personal client book\n * Analysing client profiles and implement strategy to develop sales year-on-year\n * Identify key industry partnership opportunities and introduce these to Threads\n * Manage towards annual and monthly sales portfolio targets\n * Researching, sourcing and finding product to satisfy your Clients requests and needs\n * Building strong relationships with suppliers to gain access to product\n * Driving margin percentages to maximise business revenue\n   \n   \n\nWhat You’ll Need To Succeed\n\n\n * Experience in Personal Shopping (ideally) or Luxury Retail Sales, with an established clientele network\n * Motivated by personal sales targets and enjoys exceeding them with an analytical approach\n * Confident using Mac and G-suite (Google docs, Google drive etc\n * Deep product and brand awareness with strong sales knowledge\n * Experience with luxury good and high net worth client base with a customer first approach\n * Social Media knowledge and confident learning new platforms\n * Role based in Dubai and may require some travel to KSA, Qatar and Bahrain\n   \n   \n\nWhat We Can Offer You\n\nWith us, you will turn your aspirations into reality. We will help shape your journey through enriching experiences, learning and development opportunities and exposure to different assignments within your role or through internal mobility. Our Group offers diverse career paths for those who are extraordinary, every day.\n\nWe recognise the value that you bring, and we strive to provide a competitive benefits package which includes health care, child education contribution, remote and flexible working policies as well as exclusive employee discounts.\n\nWe Invite All Applicants to Apply\n\nIt Takes Diversity Of Thought, Culture, Background, Differing Abilities and Perspectives to truly Inspire, Exhilarate and Delight our customers. At Chalhoub Group, we are committed to inclusion and diversity.\n\nWe welcome all applicants to apply and be part of our exciting future. We ensure equal opportunity for all our applicants without regard to gender, age, race, religion, national origin or disability status.",
  "contractType": "Full-time",
  "experienceLevel": "Entry level",
  "workType": "Design, Art/Creative, and Information Technology",
  "sector": "Retail Luxury Goods and Jewelry",
  "applyUrl": "https://careers.chalhoubgroup.com/jobs/4568165-personal-shopper-threads-styling-middle-east",
  "applyType": "EXTERNAL",
  "companyId": "950185",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Regional Engineering & Field Service Leader",
  "jobUrl": "https://ae.linkedin.com/jobs/view/regional-engineering-field-service-leader-at-ge-renewable-energy-3926318177?trk=public_jobs_topcard-title",
  "companyName": "GE Renewable Energy",
  "companyUrl": "https://fr.linkedin.com/company/gerenewableenergy?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Job Description Summary Grid Automation (GA) business line is supporting utility and industrial customers by providing innovative solution, enabling the energy transition and energy network transformation.\n\nThe Engineering Leader will be responsible for driving the Project & field engineering improvement for the OTR activities across all GA PL in the MENAT region. Job Description\n\nRoles And Responsibilities\n\n\n * Ensure safe operations / process for the Engineering population (Project Engineering, FAT & Field Service Engineering activities).\n * Be accountable for the Technical Competencies of the Region’s Engineering population – with additional specific focus on Complex Energy Transition projects execution.\n * Drive: Competency Assessment, Competency Gap identification & Gap closure actions (Hiring / Training / Mentoring / On-job experiential / …). Drive & Support the ITM tools and process across Project & Field Engineering population. Manage comprehensively the Region’s Engineering population Headcount including Contingent Workers, Sub-contractors to ensure Engineering efficiency. Manage the competency development process for Engineering, identify main expertise gap against the development of GA business and technologies and propose the required developments actions to the regions.\n * Be abreast of the technical growth needs of the markets and accordingly forecast the Competency needs on the Long-Term Strategy (LTS) basis (minimum Y+3)\n * Ensure L1/L2 support process in Regions for GA Products, Solutions & Services.\n * Create / Manage process to share & implement Lessons Learnt / Return of Experience (ROE) within the Region and propose suitable ROEs to share globally in close coordination with Global Operations Team.\n * Actively look for options & drive regional level Cost-out actions pertaining to Engineering function in close collaboration with Central teams (Competitiveness, Global Ops, CoE, R&D, Product Management) including the use of Global Backoffice / GECC teams effectively.\n * Drive performance, development strategy and growth of Engineering back-office\n * Ensure the implementation of DOW / DOR agreed with Interfacing Business lines within Grid Solutions/GE Vernova; and provide feedback thereof to improve the collaboration thereof.\n * Identify gap, best practices within and outside the organization, and the sharing across regions. Involve proactively in improvement initiatives with other PL (e.g., Division of Responsibilities / DOR interface definition)\n * Drive and implement Engineering related CAPEX usage and benefit realization thereof.\n * Lead Regional level Engineering process audits and support Global audits from Region’s perspective.\n * Engineering budget\n * Set and own the process to ensure effective measurement and control of the cost / days spend by the various projects against the budget / “as sold.” Analyze results and take needed action.\n * Provide feed-back to the Tendering team, adjust, and validate the costing database related to engineering.\n * Resolution of complex issues. Participate to Tender process R0, preparation of DD2 and ensure the quality of the risk analysis and mitigation actions related to Project execution activities in well defined.\n * Get involve directly involved in complex topics, by bringing leadership support, escalation, and prioritization.\n * Panel Engineering & Integration works optimization and continuous improvement on Class A, B, C material improvement to fit in line with project delivery schedule.\n * Support the deployment of tools, licenses, and IT structure for Engineering (Site testing tools, design tools / EBase, resources / load management tools, …)\n * Oversee deployment Service Max for Project & Field engineering activities.\n * Ensure compliance and initiative-taking behaviors in Quality, EHS and GE integrity program (‘The Spirit and The Letter’), being a role model to all stakeholders.\n   \n   \n\nQualifications / Requirements\n\n\n * B.Sc. degree in Electrical Electronics Engineering / Industrial Engineering or relevant background\n * Minimum 15 year experience in Project or field engineering management, Engineering & Design activities related to Power, T&D business with Automation Expertise\n * Minimum 10 years on hand-on in Panel engineering, Digital Control System, Utility Communication and Software\n * Recognized as expert in Grid Automation industry with certification from engineering bodies preferred\n * A knowledge of systems integration businesses (i.e., solutions) is necessary\n * Strong negotiation, leadership and influencing skills.\n * Excellent stakeholder management, time management and interpersonal skills\n * Capabilities to define a strategy\n   \n   \n\nDesired Characteristics\n\n\n * Integrity and autonomy\n * Able to shape strategy and direction.\n * Economic and cost awareness\n * Ability to work, listen and convince in a multicultural environment and with functional influence in a matrix organization.\n * Innovative & creative, major change agent\n * Resilient, sees setbacks as opportunities.\n   \n   \n\nAdditional Information\n\nRelocation Assistance Provided: No",
  "contractType": "Full-time",
  "experienceLevel": "Director",
  "workType": "Other",
  "sector": "Renewable Energy Equipment Manufacturing",
  "applyUrl": "https://jobs.gecareers.com/renewableenergy/global/en/job/GE11GLOBALR3765523EXTERNALENGLOBAL/Regional-Engineering-Field-Service-Leader?utm_source=linkedin&codes=linkedin&utm_medium=phenom-feeds",
  "applyType": "EXTERNAL",
  "companyId": "10279761",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Business Development Executive",
  "jobUrl": "https://ae.linkedin.com/jobs/view/business-development-executive-at-waves-3979858947?trk=public_jobs_topcard-title",
  "companyName": "Waves",
  "companyUrl": "https://kw.linkedin.com/company/waveskuwait?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "5 hours ago",
  "applicationsCount": "Over 200 applicants",
  "description": "Position Title: Business Development Executive\n\nDepartment: Business Development\n\nReports To: Head of business development\n\nLocation: UAE\n\nDate: 21 July 2024\n\n \n\nJob Overview\n\nAs a Business Development Executive at Waves Commission Agent Company, you will play a crucial role in driving the growth and success of our business. You will be responsible for identifying new business opportunities, building and maintaining strong client relationships, and collaborating with cross-functional teams to achieve sales targets. This position requires a dynamic and results-oriented individual with excellent communication and negotiation skills.\n\n \n\nKey Responsibilities\n\n 1. Market Research and Analysis\n\n * Conduct thorough market research to identify potential business opportunities and industry trends.\n * Analyze competitor strategies and market dynamics to stay ahead in the industry.\n\n 1. Lead Generation and Prospecting\n\n * Identify and generate leads through various channels such as networking, social media, and industry events.\n * Develop and maintain a pipeline of prospective clients and partners.\n\n 1. Client Relationship Management\n\n * Build and nurture strong relationships with existing and potential clients.\n * Understand client needs and provide tailored solutions to meet their business objectives.\n\n 1. Sales and Negotiation\n\n * Prepare and deliver compelling sales presentations and proposals to prospective clients.\n * Negotiate terms and close deals to achieve sales targets and objectives.\n\n 1. Collaboration and Coordination\n\n * Work closely with internal teams including marketing, product development, and customer support to ensure seamless service delivery.\n * Coordinate with the Business Development Manager to align strategies and achieve business goals.\n\n 1. Reporting and Documentation\n\n * Maintain accurate records of sales activities, client interactions, and business development efforts.\n * Prepare regular reports on sales performance, market trends, and client feedback.\n\n 1. Continuous Improvement\n\n * Stay updated with industry developments and continuously seek opportunities to enhance business strategies.\n * Participate in training and professional development programs to enhance skills and knowledge.\n\n\n\n\n Qualifications\n\n * Education: Bachelor’s degree in business administration, Marketing, or a related field.\n * Experience: 3+ years of experience in business development, sales, or a related role.\n\n\n\n\n Skills:\n\n *  Fluency in English is a must.\n * UAE experience is a must\n * A car and a valid driving license are mandatory.\n * Strong communication, presentation, and interpersonal skills.\n * Excellent negotiation and closing abilities.\n * Proficiency in CRM software and Microsoft Office Suite.\n * Ability to work independently and as part of a team.\n * Strong analytical and problem-solving skills.\n\n\n",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Business Development and Sales",
  "sector": "Technology, Information and Internet",
  "applyType": "EASY_APPLY",
  "applyUrl": "https://ae.linkedin.com/jobs/view/business-development-executive-at-waves-3979858947?trk=public_jobs_topcard-title",
  "companyId": "79821913",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Beauty Ambassador - L'Occitane - Dubai",
  "jobUrl": "https://ae.linkedin.com/jobs/view/beauty-ambassador-l-occitane-dubai-at-chalhoub-group-3943877968?trk=public_jobs_topcard-title",
  "companyName": "Chalhoub Group",
  "companyUrl": "https://ae.linkedin.com/company/chalhoubgroup?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Since 1976, L'Occitane en Provence has been imagining, producing and selling beauty, skincare and wellbeing products with an intention to share nature's wonders with the world.\n\nTheir ambition is to not only sustain lands, but to regenerate ecosystems. They believe beauty goes beyond what the eye can see.\n\nFrom seed to skin, they have a holistic in our approach and have always been ‘Cultivators of Change’. At L’Occitane en Provence, they do their best to create positive change for the world, to try to inspire everyone to do the same.\n\nWhat You'll Be Doing\n\nOur Beauty Consultant is responsible for delivering outstanding customer service to all customers and to use appropriate sales techniques and product knowledge to reach sales targets. Our Beauty Consultant is accountable for counter cleanliness, stock replenishment, handling new launches, promotion of products and merchandising. Our Consultant is also required to maintain high levels of standards in terms of grooming.\n\n\n * Build and maintain guest experience standards in order to build strong loyalty\n * Address customers' queries about products, prices, availability, product uses, and services\n * Communicate with customers to assess their needs, provide assistance in satisfying those needs an meeting or surpassing customers expectations\n * Advise customers on product ranges best suited to their needs\n * Demonstrate usage and benefits of various brands and products\n * Generate sales, while achieving line and sales targets, using make up knowledge\n * Sell-out target tracking at store level\n * Generate daily sales reports\n * Participate in achieving incentives\n * Track post-launch sales at store level\n * Ensure merchandising levels in the store are met as per the brand guidelines\n * Ensure in store stock replenishment in the appropriate shelves/counters, at appropriate times\n * Report stock shortages using the stock order form\n * Ensure stock receipt as per set procedures\n   \n   \n\nWhat you'll need to succeed\n\n\n * Minimum 2 years’ experience in the beauty retail industry\n   \n   \n\nWhat We Can Offer You\n\nWith us, you will turn your aspirations into reality. We will help shape your journey through enriching experiences, learning and development opportunities and exposure to different assignments within your role or through internal mobility. Our Group offers diverse career paths for those who are extraordinary, every day.\n\nWe recognise the value that you bring, and we strive to provide a competitive benefits package which includes health care, child education contribution, remote and flexible working policies as well as exclusive employee discounts.\n\nWe Invite All Applicants to Apply\n\nIt Takes Diversity Of Thought, Culture, Background, Differing Abilities and Perspectives to truly Inspire, Exhilarate and Delight our customers. At Chalhoub Group, we are committed to inclusion and diversity.\n\nWe welcome all applicants to apply and be part of our exciting future. We ensure equal opportunity for all our applicants without regard to gender, age, race, religion, national origin or disability status.",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Other",
  "sector": "Retail Luxury Goods and Jewelry",
  "applyUrl": "https://careers.chalhoubgroup.com/jobs/4585677-beauty-ambassador-l-occitane-dubai",
  "applyType": "EXTERNAL",
  "companyId": "950185",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Finance Director, IMET",
  "jobUrl": "https://ae.linkedin.com/jobs/view/finance-director-imet-at-chep-3979856965?trk=public_jobs_topcard-title",
  "companyName": "CHEP",
  "companyUrl": "https://uk.linkedin.com/company/chep?trk=public_jobs_topcard-org-name",
  "location": "Dubai, United Arab Emirates",
  "postedTime": "6 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Position Purpose: The Finance Director for India, the Middle East, and Türkiye will lead and oversee all financial aspects of the company's operations in these regions. This role is essential in guiding the financial strategy, ensuring robust financial management, and driving business growth and transformation. The Finance Director will play a crucial role in financial planning, analysis, and control, while also serving as a strategic partner to the business units, ensuring alignment of financial goals with the company's overall objectives. This position requires a dynamic leader who can effectively navigate diverse market landscapes, champion financial best practices, and lead a team towards operational excellence and innovation. The Finance Director will also be instrumental in delivering transformation plans, optimizing financial processes, and contributing to the long-term financial health and success of the organization.\n\n\n\n\nScope: IMET Region / Annual Revenue Budget: $70M / Number of Countries: 8\n\n\n\n\nResponsibility:\n\nStrategic financial analysis and project support:\n\n 1. Lead the IMET Finance team to provide the wider business with analytics and insights to support strategic and operational decision making, and in doing so, influences improved business performance and capital allocation decisions\n 2. Drives the implementation and application of a regional consistent commercial policy, through the use of standard practices and tools\n 3. Oversight of the competitive assessment and product lifestyle reviews across the region to monitor on-going competitiveness and asset utilization\n 4. Support the team that provides analytical support to the Finance BPs on supply chain, operations, transport, plant cost analysis, business case preparation, improvement initiatives, supply chain business case governance and global alignment\n 5. Support long-term planning activities and the 4YP to provide a robust and timely strategic plan\n 6. Lead the efficient service delivery of other Business Support & Analysis activities to internal customers\n\nFP&A:\n\n 1. Budgeting and Forecasting: Lead the development and management of the annual budget and quarterly forecasting processes. This involves working with the regions to develop budgets and forecasts, reviewing and analyzing budget variances, and recommending changes to achieve financial targets.\n 2. Financial Reporting: Lead the development and review of financial reports, presentations, and other materials for executive management. This includes analyzing financial data, interpreting financial results, and providing recommendations based on the analysis.\n 3. Strategic plan: Lead the development and management of the company's long-term financial planning process. This includes supporting the regions to develop financial plans and forecasts for 4 years or more, reviewing and analyzing plan variances, and recommending changes to achieve long-term financial targets.\n 4. Financial Analysis: Conducting financial analysis to support strategic decision-making. This includes analyzing financial data, identifying trends, and providing insights on key performance indicators (KPIs) to drive long-term business decisions.\n 5. Risk and Opportunities Analysis: Conducting risk assessments and identifying potential risks and opportunities that may impact the company's financial performance. This includes developing risk management strategies, monitoring risk exposure, and developing contingency plans to mitigate risks.\n 6. The IMET Finance Business Partner will also be responsible for identifying and evaluating potential business opportunities and providing financial insights and guidance on strategic initiatives that may arise. This involves working collaboratively with other teams to ensure that the company's overall financial goals and objectives are met, while managing potential risks and opportunities\n\n\n\n\nTransformation Finance:\n\n 1. Delivery of the bankable plan. Short term achievements for FY23 and ensuring framework and structure for achievement of the outer years.\n 2. Pressure test key initiatives, enabling success of financial metrics and evaluation of the portfolio and prioritization for value\n 3. Assess complex initiative- and function-level contribution of transformation projects to underlying business financial performance\n 4. Identify short- and mid-term financial risks and opportunities to enable informed decisions and actions across all areas of the business\n 5. Continuously collaborate with other business functions to manage and align transformation financial impacts and outlooks\n 6. Regularly provide business updates and insights on initiatives, investments, and financial returns\n\n\n\n\nAsset Productivity:\n\n 1.  Finance business Partnering to provide the relevant support and insights to drive the delivery of the overall asset management strategy\n 2.  Ownership of the Asset Management metrics for the region and driving continuous improvement\n 3.  Enhance visibility of operational, commercial and strategic impacts on asset productivity (CAPEX/Sales, Leakage Rate, Cycle Times, Damage/Scrap etc)\n 4.  Provide strategic financial insights for asset management initiatives and projects to support effective decision making (cost vs value analyzer)\n 5.  Liaise with Controllership on IPEP inputs and other asset accounting matters\n 6.  Calculate “compensation for usage” insights that capture the Asset Productivity cost and benefit of strategic, commercial and pricing decisions, pertaining to asset losses, compensations (compensation and cash replacement coverage)\n 7.  Oversee the asset productivity transformation initiatives and digital programmes ensuring the successful delivery of the asset management portfolio and complete, accurate and timely reporting of associated financials\n 8.  Understand the financial impact of key strategic and operational decisions. The quality and effectiveness of the capital allocation decision support will be measured by the growth or change in ROCI performance and capex/sales ratio\n 9.  Provide tools and analysis that facilitate collaboration and drive asset productivity efficiencies and improvement with Supply Chain stakeholders\n 10. Ensure that all adjustments related to assets are completely and accurately captured in a timely manner\n 11. Lead the process and controls elements of the asset management strategy ensuring a robust control environment\n 12. Drive a robust risk management process with support on the local and regional Risk Registers to ensure risks pertaining to asset management and associated mitigation plans are defined\n 13. Deliver Data analytics and financials to guide stakeholders and countries to execute valuable actions to change customer behaviours and avoid bad practices.\n 14. Develop a systematic approach for reporting, data and insights related to AP across the whole organization in close coordination with Shaping our Future control tower\n\n\n\n\n\n\n\nRisk management:\n\n 1. Lead the risk management process for IMET Developing and implementing a comprehensive risk management strategy. This includes identifying and assessing risks and supporting in the development of risk mitigation plans.\n 2. Risk Assessment: Conducting risk assessments to identify potential risks and their likelihood and impact. This includes analyzing data, conducting research, and collaborating with other teams to identify potential risks.\n 3. Risk Reporting: Providing regular risk reports and updates to Brambles risk, the IMET leadership team. This includes summarizing key risks, outlining risk mitigation strategies, and providing recommendations for addressing any new risks that emerge\n\n\n\n\nManaging a team of finance managers and analysts. This involves setting goals, providing guidance and support, and evaluating performance.\n\n\n\n\nContinuous Improvement: Identifying and implementing process improvements across all departments in strategic finance and the broader IMETA finance team.\n\n\n\n\nQualifications\n\n\n\n\n\n\n\nEssential Qualifications\n\n\n\n\nBachelor’s degree in Finance/ Accounting or in a relevant finance technical discipline\n\nDesirable Qualifications\n\n\n\n\nCA (SA)/ CIMA qualified\n\nMBA (desirable)\n\n\n\n\nExperience\n\n\n\n\n8+ years of Finance or Accounting Management experience preferably in complex multinational businesses within Senior Finance roles, including previous business partnering experience, FP&A type role and commercial/ Supply Chain finance expertise and Previous experience managing and working in a matrix organization cross functionally.\n\n\n\n\n\n\n\nSkills and Knowledge\n\n\n\n\n-Good understanding of FP&A, Commercial and Supply Chain Finance processes\n\n-Good understanding of complex Finance, Accounting and Tax principles\n\n-Excellent written, verbal, and interpersonal skills\n\n-Advanced use of Microsoft applications – Excel, Outlook and PowerPoint\n\n-Proven expertise in remote management and managing in a matrix experience\n\n-Decision maker, driven by objectives, solutions and results\n\n-Strategic and critical thinker, can anticipate & provide scenarios for different problems\n\n-Consistent behavior even under strong pressure\n\n-Computer: SAP, M/soft Office suite including advanced Excel\n\n\n",
  "contractType": "Full-time",
  "experienceLevel": "Director",
  "workType": "Finance",
  "sector": "Transportation, Logistics, Supply Chain and Storage",
  "applyUrl": "https://brambles.wd5.myworkdayjobs.com/Brambles_Careers/job/Istanbul-Istanbul-Trkiye/Director-Finance\\u002d\\u002d-IMET_JR15974",
  "applyType": "EXTERNAL",
  "companyId": "5085",
  "posterProfileUrl": "https://ae.linkedin.com/in/hala-j-1633251ab",
  "posterFullName": "Hala J."
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Business Development Executive | Arabic Speaker | Dubai",
  "jobUrl": "https://ae.linkedin.com/jobs/view/business-development-executive-arabic-speaker-dubai-at-ventures-middle-east-vme-3978983773?trk=public_jobs_topcard-title",
  "companyName": "Ventures Middle East (VME)",
  "companyUrl": "https://ae.linkedin.com/company/ventures-middle-east?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "7 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Ventures ONSITE (www.venturesonsite.com), a product by Ventures Middle East is a subscription based platform utilized as business development tool providing accurate and detailed information on completed, on-going and future construction projects.\n\nThe primary responsibility of the Business Development Executive is to sell MEA Construction Projects Data Base to Construction industry and to meet and or exceed the assigned quota within an assigned target.\n\nRoles And Responsibilities\n\n\n * Ensure his/her territory achieves or exceeds required quota\n * Independently develop processes to obtain leads through possible sourcing opportunities, and work closely with company partners to leverage prospects/clients\n * Contact potential clients to assess their individual needs and demonstrate how the products can meet or exceed these needs\n * Professional communication in written form is required\n * Develop and submit comprehensive proposals for all potential clients\n * Maintain accurate up-to-date sales pipeline and forecasts\n * Attend exhibitions and conferences where the company is participating, to promote company's products and services\n * Ensure companies image, its products and services are presented to clients and prospects in a professional manner\n * Assist Account Manager for sales and marketing activities\n * Assist Research Team if needed in collecting any information for product improvement\n   \n   \n   \n\nQualifications\n\n\n * English essential\n * Understanding of the Construction & Energy sector\n * Demonstrated experience developing processes to obtain\n * leads through comparison and evaluation of possible sourcing opportunities\n * Expertise in territory management and organization\n * Proven ability to achieve goal\n * Demonstrated earnings history\n * Excellent verbal and written communication skills\n * Exceptional organizational skills\n * Self-motivated to work independently, with team support,\n * to close business\n * Demonstrated commitment to completing tasks and\n * objectives\n * Effectively work with Microsoft Office applications, including Outlook, Word, Excel, and PowerPoint\n   ",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Business Development and Sales",
  "sector": "Business Consulting and Services",
  "applyUrl": "https://www.careers-page.com/ventures-middle-east/job/L39VXY6V?utm_medium=free_job_board&utm_source=linkedin",
  "applyType": "EXTERNAL",
  "companyId": "109568",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "CCNA - B2B Regional Sales Manager (French speaker)",
  "jobUrl": "https://ae.linkedin.com/jobs/view/ccna-b2b-regional-sales-manager-french-speaker-at-canon-emea-3928904339?trk=public_jobs_topcard-title",
  "companyName": "Canon EMEA",
  "companyUrl": "https://uk.linkedin.com/company/canon-emea?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "The purpose of the role is to proactively manage the sales performance of the team to achieve and report on the activity and sales. Responsibility for maximizing sales of Canon solutions and services to customers within the channel.\n\nWhat We Give\n\nWith Canon, you'll get the support and encouragement you need to grow, from people who share your ambition. We'll invest in your professional development to help you learn and progress in your role with us. You'll find leaders who give you the freedom to explore new things and a team where knowledge is shared openly.\n\nAt Canon we have a clear vision to be committed to creating a more inclusive and equitable culture where employees are valued and can thrive personally and professionally.\n\nCanon also has a strong commitment to sustainability, encompassed by our Kyosei philosophy of living and working together for the common good, focused on reducing our environmental impact and creating opportunities to make positive social contribution.\n\n\n * Motivate and provide leadership to the team to ensure all sales targets are met and that Strategic Account Management principles are applied.\n * Facilitate and coach the team to work together and ensure all the value-added propositions are delivered.\n * Provide leadership and drive the team promoting teamwork, effective collaboration, and constructive working relationships.\n * Monitor and report progress and performance targets.\n * Actively seek relevant information to stay ahead of the competition and remain up to date with the industry.\n * Contribute proactively to the evolution of change management within the organization and contribute to the business strategic agenda.\n * Provide comprehensive forecast reports and deliver required monthly sales feedback reports.\n * Owning the Partner/ Area budgeting process with support of the country managers.\n * Pricing analysis and discussion with product managers.\n * Devise and implement area marketing strategy.\n   \n   \n\nWhat we ask\n\nInterpersonal Requirements\n\n\n * Strong B2B sales experience with proven track record and success - essential.\n * Experience in North and West/Central Africa - essential.\n * Excellent communicator and public speaker.\n * Excellent interpersonal skills at all levels.\n * Accuracy and attention to detail.\n * Excellent Analytical & reporting skills.\n * Strong change management capabilities.\n * Commercial and conceptual thinker.\n * Highly driven and results oriented, aggressive approach to winning business.\n * French and English speaker - essential.\n * Arabic speaker - desirable.\n   \n   \n\nPrevious Experience/ Education\n\n\n * Relevant recognized formal qualifications (university level) - desirable.\n   \n   \n\nYou will need\n\n\n * Business outcome driven.\n * Courageous and has conviction.\n * Ensures delivery of the outcome.\n * Customer Oriented.\n * Innovates by building on skills and experience.\n * Inspirational and motivational.\n * Builds trust based relationships.\n * Develops and coaches others.\n   \n   \n\nFurther Information\n\nCanon is an equal opportunity employer. Canon recruits, employs, trains, compensates and promotes regardless of race, religion, national origin, sex, disability, age, veteran status or other protected status as required by law.\n\n",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Sales, Business Development, and Product Management",
  "sector": "Computers and Electronics Manufacturing, IT Services and IT Consulting, and Printing Services",
  "applyUrl": "https://careers.peopleclick.eu.com/careerscp/client_canoneurope/external/jobDetails.do?functionName=getJobDetail&jobPostId=50856&localeCode=en-us&source=LinkedIn&sourceType=PREMIUM_POST_SITE",
  "applyType": "EXTERNAL",
  "companyId": "209557",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Case Processing Officer (Citizenship By Investment)",
  "jobUrl": "https://ae.linkedin.com/jobs/view/case-processing-officer-citizenship-by-investment-at-ag-mena-3979878037?trk=public_jobs_topcard-title",
  "companyName": "AG Mena",
  "companyUrl": "https://ae.linkedin.com/company/ag-mena?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "4 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Citizenship Processing Officer (Citizenship by Investment)\n\n\n\n\nAG MENA is seeking a dynamic individual with excellent organizational skills for a position as a Case Processing Officer to support the high-end services provided by a global leader in second citizenship and residency planning. Candidates will be advising on opportunities for High Net Worth Individuals (HNWIs) to obtain second citizenship by investment for Caribbean and Commonwealth countries. Experience in processing St. Kitts & Nevis, Grenada, Dominica, St. Lucia, and Antigua & Barbuda files is a must, and also European Residency by Investment Programs including Portugal, Greece and Latvia.\n\n\n\n\nWe want a candidate who has excellent communication skills, a problem-solving attitude, excellent attention to detail, and embraces our mission and vision.\n\n\n\n\nDuties and responsibilities:\n\n\n\n\n- Know how to update all program-related documents for each product in conjunction with the processing officer\n\n- Organizes and processes file according to assigned deadlines.\n\n- Provides accurate information and provide updates all in a timely manner\n\n- Maintain current and accurate records of clients, both in paper form and electronically.\n\n- Liaises with local service agents involved in file processing on files under the supervisor of direct line manager;\n\n\n\n\nAdditional Duties:\n\n\n\n\n› Liaising with local authorities in the UAE and using their online portals to submit documents on behalf of clients for a range of matters, including company incorporations;\n\n\n\n\nEmployment: Full Time\n\n\n\n\nLocation: Dubai\n\n\n\n\nRequirements:\n\n\n\n\n› Previous experience in citizenship by investment/business immigration services and/or law firm environment\n\n\n\n\n› Strong communication and organisational skills and meticulous attention to detail.\n\n\n\n\n› Able to work effectively under pressure with little or no supervision.\n\n\n\n\n› Must be based in the UAE.\n\n\n\n\nPlease submit your CV and Cover Letter to: info@ag-mena.com",
  "contractType": "Full-time",
  "experienceLevel": "Entry level",
  "workType": "Law Practice",
  "sector": "",
  "applyType": "EASY_APPLY",
  "applyUrl": "https://ae.linkedin.com/jobs/view/case-processing-officer-citizenship-by-investment-at-ag-mena-3979878037?trk=public_jobs_topcard-title",
  "companyId": "77281247",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Regional Sales Manager - Enterprise Sales",
  "jobUrl": "https://ae.linkedin.com/jobs/view/regional-sales-manager-enterprise-sales-at-businessnext-3981590209?trk=public_jobs_topcard-title",
  "companyName": "BUSINESSNEXT",
  "companyUrl": "https://in.linkedin.com/company/business_next?trk=public_jobs_topcard-org-name",
  "location": "Dubai, United Arab Emirates",
  "postedTime": "1 hour ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Welcome to BUSINESSNEXT, where we believe in maximizing your true potential while doing something purposeful, we invite you to #UNLIMIT with us. Our commitment to innovation and forward-thinking is reflected in everything we do, and we're looking for like-minded individuals to join our team. If you're looking for a rewarding career in a company that values your creativity, collaboration, and innovation, we invite you to explore this opportunity and join us in being #UpForTomorrow.\n\n\n\n\nThe Opportunity:\n\nWe are currently looking for a passionate and dynamic individual to join us in the Middle East\n\nNew Sales team. The ideal candidate would be a person with an entrepreneurial mindset,\n\nsmart and confident, innovative, and Self-motivated with a passion for new sales (Hunting) and a love for solving business problems with a strong 360-degree perspective on accounts and a result-oriented outlook.\n\n\n\n\nObjectives aligned to this role:\n\nEnterprise Sales, Ideas, and Implementation towards achieving Key Results.\n\n\n\n\nWhat would you do?\n\n•Generate prospects and manage a sales pipeline sufficient to achieve quota targets.\n\n•Being a Hunter role, achieve assigned ARR Target each Q for the Financial Year & get new Logos.\n\n•Build pipelines across assigned territory through business development and networking opportunities.\n\n•Develop and communicate effective business and action plans to address opportunities.\n\n•Coordinate and collaborate with appropriate sales consultants and support resources to deliver sales solutions to clients successfully.\n\n•Actively contribute to knowledge sharing on client’s needs and contexts,\n\n•Conduct needs/ solutions analysis to position solutions effectively.\n\nGenerate and follow up on proposals/ offers to prospects.\n\n•Identify and understand key decision makers, users and influencers at assigned customer organizations.\n\n•Develop and maintain high – level relationships with key decision makers.\n\n•Ensure the highest level of client satisfaction and reference-ability.\n\n•Responsible for Cold calling and generating leads.\n\n•Drive sales growth by identifying opportunities and increasing our market presence in the BFSI industry. Engage in bid defense, negotiation, account mapping, and relationship building.\n\n•Create compelling Sales pitches and responsible for initial company presentations and product demonstrations.\n\n•Individual contributor role for the first year with a progressive growth path leading to team management.\n\n\n\n\nRequired Skills:\n\n•10-15 years of Selling IT Products and solutions.\n\n•Must have experience in selling Software applications in BFSI Industry\n\n•Must be able to conduct presentations and do a value creation.\n\n•Strong clients focus and deep background in all aspects of the sales process and life cycle including the customer experience journey.\n\n•Proven track record in strategic/ consultative selling and results against quota.\n\n•Knowledge and experience in selling IT services and solutions in Global delivery models. A comprehensive knowledge of customer experience platforms and related digital solutions is preferred.\n\n•Demonstrate sales skills, passionate selling mindset and client service focus.\n\n•Action and result orientation with high levels of energy, persistence, and self-motivation with strong leadership and motivational capabilities.\n\n•Highly energetic, proactive and creative.\n\n•Superior presentation skills, both oral and written.\n\n•Exceptional communication and presentation skills. Fluent in English, with preference given to Arabic speakers.\n\n•Demonstrates a strong grasp of technological as well as commercial aspects, including proposal preparation, contract negotiation, and commercial discussions.\n\n\n\n\nAcademic Qualification:\n\n•Engineering/ equivalent technical qualification/ Any graduation OR Postgraduation in Management from a reputed college/ university.",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Software Development",
  "sector": "",
  "applyType": "EASY_APPLY",
  "applyUrl": "https://ae.linkedin.com/jobs/view/regional-sales-manager-enterprise-sales-at-businessnext-3981590209?trk=public_jobs_topcard-title",
  "companyId": "72231092",
  "posterProfileUrl": "https://in.linkedin.com/in/vaibhav-tripathi-98733829",
  "posterFullName": "Vaibhav Tripathi"
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Sales Associate",
  "jobUrl": "https://ae.linkedin.com/jobs/view/sales-associate-at-iiqafgroup-3979462117?trk=public_jobs_topcard-title",
  "companyName": "IIQAFGROUP",
  "companyUrl": "https://ae.linkedin.com/company/iiqafgroup?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "23 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "We are looking for a result-driven retail Sales Associate to be responsible for all sales job duties, from generating leads to closing sales.\n\nYour responsibilities include working closely with customers to determine their needs, answer their questions about our products and recommend the right solutions. You should also be able to promptly resolve customer complaints and ensure maximum client satisfaction.\n\nTo be successful as a Sales associate, you should stay up-to-date with product features and maintain our store’s visual appearance in high standards.\n\nYour duties are to achieve excellent customer service, while consistently meeting the store’s sales goals.\n\nResponsibilities\n\n\n * Ensure high levels of customer satisfaction through excellent sales service\n * Assess customers needs and provide assistance and information on product features\n * Welcome customers to the store and answer their queries\n * Follow and achieve the department’s sales goals on a monthly, quarterly and yearly basis\n * “Go the extra mile” to drive sales\n * Maintain in-stock and presentable condition assigned areas\n * Actively seek out customers in the store\n * Remain knowledgeable on products offered and discuss available options\n * Process POS (point of sale) purchases\n * Cross-sell products\n * Handle returns of merchandise\n * Team up with co-workers to ensure proper customer service\n * Build productive trust relationships with customers\n * Comply with inventory control procedures\n * Suggest ways to improve sales (e.g. planning marketing activities, changing the store’s design)\n   \n   \n\nRequirements\n\n\n * Proven work experience as a Retail Sales associate, Sales representative or similar role\n * Basic understanding of sales principles and customer service practices\n * Proficiency in English\n * Basic Math skills\n * Working knowledge of customer and market dynamics and requirements\n * Track record of over-achieving sales quota\n * Hands-on experience with POS transactions\n * Familiarity with inventory procedures\n * Solid communication and interpersonal skills\n * A friendly and energetic personality with customer service focus\n * Ability to perform under pressure and address complaints in a timely manner\n * Availability to work flexible shifts\n * High school degree; BS degree in Marketing or related field would be a plus",
  "contractType": "Full-time",
  "experienceLevel": "Entry level",
  "workType": "Sales and Business Development",
  "sector": "Hospitality",
  "applyUrl": "https://jobs.gohire.io/CEXdPl7W/181532",
  "applyType": "EXTERNAL",
  "companyId": "96161556",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Retail Sales Associate",
  "jobUrl": "https://ae.linkedin.com/jobs/view/retail-sales-associate-at-iiqafgroup-3979461507?trk=public_jobs_topcard-title",
  "companyName": "IIQAFGROUP",
  "companyUrl": "https://ae.linkedin.com/company/iiqafgroup?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "23 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "We are looking for a dynamic and customer-focused Retail Sales Associate to join our team. As a Retail Sales Associate, you will be responsible for providing exceptional sales support and customer service to ensure an excellent shopping experience for our customers. You will work closely with the store team to meet sales targets and ensure customer satisfaction.\n\nResponsibilities\n\n\n * Greet and assist customers as they enter the store\n * Provide personalized recommendations and product knowledge to customers\n * Process sales transactions accurately and efficiently\n * Maintain a clean and organized store environment\n * Monitor inventory levels and restock shelves as needed\n * Assist in visual merchandising and product placement\n * Collaborate with team members to achieve sales targets\n * Provide support during special promotions and events\n * Resolve customer complaints and issues in a professional and timely manner\n * Stay updated on product knowledge and latest trends in the industry\n   \n   \n\nRequirements\n\n\n * High school diploma or equivalent\n * Previous experience in retail sales is preferred\n * Strong communication and interpersonal skills\n * Excellent customer service skills\n * Ability to work in a fast-paced environment\n * Attention to detail and accuracy in handling sales transactions\n * Physical stamina to stand for long periods of time and lift heavy objects\n * Flexibility to work evenings, weekends, and holidays as needed\n * Knowledge of POS systems and basic computer skills\n * Positive attitude and willingness to learn and adapt to changes in the retail industry",
  "contractType": "Full-time",
  "experienceLevel": "Entry level",
  "workType": "Sales and Business Development",
  "sector": "Hospitality",
  "applyUrl": "https://jobs.gohire.io/CEXdPl7W/181533",
  "applyType": "EXTERNAL",
  "companyId": "96161556",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Field Sales Manager - F&B",
  "jobUrl": "https://ae.linkedin.com/jobs/view/field-sales-manager-f-b-at-ecolab-3929089772?trk=public_jobs_topcard-title",
  "companyName": "Ecolab",
  "companyUrl": "https://www.linkedin.com/company/ecolab?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Join Ecolab’s Food & Beverage team as Field Sales Manager - F&B in Dubai, UAE and help make the world cleaner, safer and healthier. We’re growing and need talented people like you to help us continue to protect the world’s most vital resources.\n\nWhat’s In It For You\n\n\n * The opportunity to take on some of the world’s most meaningful challenges, helping customers achieve clean water, safe food, abundant energy and healthy environments\n * The ability to make an impact and shape your career with a company that is passionate about growth\n * The support of an organization that believes it is vital to include and engage diverse people, perspectives and ideas to achieve our best\n   \n   \n\nWhat You Will Do\n\n\n * Set team objectives and monitor their progress.\n * Communicate and work with other members of the company to achieve the objectives.\n * Accompany and assess staff in the field periodically to ensure objectives are met and to identify training needs. The frequency of these field days is to be agreed with your line manager.\n * Recognize and reward good individual and team performance.\n * Observe the company rules for grievance and disciplinary matters.\n * Hold regular meetings to brief your sales team and promote teamwork.\n * Deal effectively and speedily with customer complaints and account issues.\n * Actively assist the sales team, giving technical support and encouraging technicians to identify and submit leads.\n * Demonstrated ability to train, coach, motivate and supervise district personnel to full potential.\n   \n   \n\nPreferred Qualifications\n\n\n * BS/BA degree in dairy, food or agricultural science, engineering, chemistry, biology, or related field\n * 15+ year experience in B2B Sales including field sales experience and in food, beverage or dairy processing/manufacturing industries.\n * Functional computer application literacy (including Microsoft Office Suite, and ability to learn internal business systems)\n * Valid driver's license and acceptable motor vehicle record\n * People management, P&L management experience is a must.\n * Experience in large account management.\n * Ability to convert a technical need into a commercial solution.\n * Understanding of technological processes and F&B Sector knowledge\n * Exceptional interpersonal, communication, and presentation skills\n * Desire to succeed in a competitive environment.\n * Ability to take initiative, work independently and prioritize multiple projects with strong follow-through and organizational skills.\n   \n   \n\nAbout Food & Beverage\n\nSee how Ecolab helps make 27% of the world’s processed food safe. In Food & Beverage, you’ll help a wide variety of food, beverage, and brewery processors manage the increasing risks of foodborne illness and contamination. By providing cleaning and sanitizing programs, animal care products, antimicrobial food tissue treatment and many other operational efficiency and product quality programs, Food & Beverage offers the opportunity to work with a combination of innovation and world-class service.\n\nOur Commitment to Diversity and Inclusion\n\nEcolab is committed to fair and equal treatment of associates and applicants and furthering the principles of Equal Opportunity to Employment. Our goal is to fully utilize minority, female, and disabled individuals at all levels of the workforce. We will recruit, hire, promote, transfer and provide opportunities for advancement based on individual qualifications and job performance. In all matters affecting employment, compensation, benefits, working conditions, and opportunities for advancement, Ecolab will not discriminate against any associate or applicant for employment because of race, religion, color, creed, national origin, citizenship status, sex, sexual orientation, gender identity and expressions, genetic information, marital status, age, or disability.",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Sales",
  "sector": "Chemical Manufacturing",
  "applyUrl": "https://jobs.ecolab.com/global/en/job/EIYEIEUSR00233748EXTERNALENGLOBAL/Field-Sales-Manager-F-B?utm_source=linkedin&utm_medium=phenom-feeds",
  "applyType": "EXTERNAL",
  "companyId": "4713",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Telesales Specialist",
  "jobUrl": "https://ae.linkedin.com/jobs/view/telesales-specialist-at-vracademi-ai-metaverse-lab-3765437692?trk=public_jobs_topcard-title",
  "companyName": "VRAcademi Ai & Metaverse Lab",
  "companyUrl": "https://ae.linkedin.com/company/vracademi?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "9 hours ago",
  "applicationsCount": "81 applicants",
  "description": "Roles and Responsibilities\n\n * Outbound Calls: Make outbound calls to potential customers to introduce VRAcademi’s VR educational programs and services.\n * Lead Generation: Identify and qualify leads through various channels, including known calling, email campaigns, and social media outreach.\n * Product Knowledge: Maintain an in-depth understanding of our courses, workshops, and course offerings to effectively communicate their benefits to potential customers.\n * Customer Engagement: Build and maintain strong relationships with prospects by understanding their needs and providing tailored solutions.\n * Sales Targets: Meet and exceed monthly sales targets and KPIs set by the sales manager.\n * Follow-up: Conduct follow-up calls and emails to ensure timely conversion of leads into customers.\n * CRM Management: Update and manage customer information in the CRM system accurately and timely.\n * Feedback Collection: Gather customer feedback and share insights with the marketing and product development teams to improve our offerings.\n * Team Collaboration: Collaborate with the sales and marketing teams to develop and implement effective sales strategies.\n\n\n\n\n Desired Candidate Profile\n\n\n\n\n﻿Professional Experience:\n * Telesales Expertise: Proven track record of success in telesales, telemarketing, or outbound sales roles, preferably in the education or technology sectors.\n * Customer Interaction: Experience in engaging with customers over the phone, understanding their needs, and providing effective solutions.\n * Sales Achievement: Demonstrated ability to meet and exceed sales targets, with a strong understanding of sales processes and techniques.\n\nSkills and Competencies:\n * Excellent Communication: Exceptional verbal and written communication skills, with the ability to clearly articulate the benefits of our programs and engage potential customers.\n * Persuasion and Negotiation: Strong persuasive skills to influence potential customers and negotiate deals effectively.\n * Customer-Centric Approach: Ability to build rapport and maintain strong relationships with customers, focusing on their needs and satisfaction.\n * Tech-Savvy: Comfortable using customer relationship management (CRM) software, sales tools, and virtual communication platforms.\n * Problem-Solving: Resourceful and adept at overcoming objections and finding solutions to customer concerns.\n * Self-Motivation: Highly driven, proactive, and capable of working independently with minimal supervision in a remote environment.\n\nEducational Background:\n * Minimum Education: High school diploma or equivalent.\n * Preferred Education: Bachelor’s degree in business, marketing, communications, or a related field.\n\nPersonal Attributes:\n * Enthusiastic and Energetic: A positive attitude and enthusiasm for sales and customer engagement.\n * Resilient and Persistent: Determination and resilience to handle rejection and continue pursuing sales opportunities.\n * Organized and Detail-Oriented: Strong organizational skills with attention to detail in managing customer information and follow-up activities.\n * Team Player: Ability to collaborate effectively with team members, sharing insights and strategies to achieve collective goals.\n * Adaptable: Flexibility to adapt to changing sales strategies and market conditions.\n\nAdditional Qualities:\n * Passion for Education: A genuine interest in the education sector and a desire to contribute to the growth and success of VRAcademi.\n * Innovative Mindset: Open to new ideas and approaches, with a willingness to learn and implement innovative sales techniques.\n * Cultural Fit: Alignment with VRAcademi’s values and mission, demonstrating integrity, professionalism, and a commitment to excellence.\n\n\n",
  "contractType": "Full-time",
  "experienceLevel": "Entry level",
  "workType": "Sales and Business Development",
  "sector": "Software Development",
  "applyType": "EASY_APPLY",
  "applyUrl": "https://ae.linkedin.com/jobs/view/telesales-specialist-at-vracademi-ai-metaverse-lab-3765437692?trk=public_jobs_topcard-title",
  "companyId": "71234955",
  "posterProfileUrl": "https://ae.linkedin.com/in/shubhankar-tiwari",
  "posterFullName": "SHUBHANKAR TIWARI"
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Investment Banking - MENA M&A - Analyst / Associate – Dubai",
  "jobUrl": "https://ae.linkedin.com/jobs/view/investment-banking-mena-m-a-analyst-associate-%E2%80%93-dubai-at-jpmorganchase-3981599927?trk=public_jobs_topcard-title",
  "companyName": "JPMorganChase",
  "companyUrl": "https://www.linkedin.com/company/jpmorganchase?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "1 hour ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Job Description\n\nThis is an exciting opportunity for someone who is highly motivated to work in a dynamic team and to contribute to our Investment Banking business.\n\nWithin Investment Banking, our MENA M&A team is market leading in a high growth business, providing significant, high profile deal execution experience. The team works with a broad range of clients, including corporations, institutions and governments, to provide comprehensive strategic advice, capital raising and risk management expertise. In-depth, industry-specific expertise and regional market acumen enable us to serve the evolving needs of clients around the world. Our first-class business in a first-class way approach to serving clients drives everything we do. We strive to build trusted, long-term relationships by taking a holistic and forward-looking view on our relationships, and identifying ways to help clients achieve their most important business objectives.\n\nAs an M&A Analyst / Associate within our dynamic MENA M&A team, you will play a crucial role in the origination and execution of public and private mergers, acquisitions, and divestitures across all industry sectors. Collaborating with other team members and colleagues from various industry, country, and product teams in other regions/countries, you will gain hands-on experience, continuous mentoring, feedback, and numerous opportunities for professional development.\n\nWe are looking for Analyst / Associate across different levels.\n\nJob Responsibilities\n\n\n * Support execution, marketing and coverage work across industries\n * Conduct research and analyse market data and companies\n * Support preparation of client presentations\n * Perform valuation analyses (e.g. based on multiples, DCF, LBO, etc.)\n * Build detailed and complex financial models\n * Execute transactions from pitch to close (e.g. public and private mergers, acquisitions and divestitures across all industry sectors)\n * Partner with equity, debt and markets groups covering the region\n * Manage marketing materials and league tables\n * Oversee M&A database covering regulatory requirements from different jurisdictions as well as market trends and themes\n   \n   \n\nRequired Qualifications, Capabilities And Skills\n\n\n * Relevant full-time Investment Banking, M&A or Corporate Finance experience\n * Proven financial modelling, valuation and analytical skills\n * High level of attention to detail across deliverables\n * Knowledge about the transaction cycle of M&A assignments\n * Demonstrate commitment to a strong teamwork environment\n * Being adaptable, flexible and resilient; ability to work self-directed and independently and to multitask on numerous assignments\n * Proficiency in MS office applications and relevant knowledge of customary investment banking databases (FactSet, Bloomberg, etc.)\n   \n   \n\nPreferred Qualifications, Capabilities And Skills\n\n\n * MENA experience and Arabic language skills\n   \n   \n\nABOUT US\n\nJ.P. Morgan is a global leader in financial services, providing strategic advice and products to the world’s most prominent corporations, governments, wealthy individuals and institutional investors. Our first-class business in a first-class way approach to serving clients drives everything we do. We strive to build trusted, long-term partnerships to help our clients achieve their business objectives.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n\nAbout The Team\n\nThe Corporate & Investment Bank is a global leader across investment banking, wholesale payments, markets and securities services. The world’s most important corporations, governments and institutions entrust us with their business in more than 100 countries. We provide strategic advice, raise capital, manage risk and extend liquidity in markets around the world.",
  "contractType": "Full-time",
  "experienceLevel": "Not Applicable",
  "workType": "Finance and Sales",
  "sector": "Financial Services",
  "applyUrl": "https://JPMorganChase.contacthr.com/140442940",
  "applyType": "EXTERNAL",
  "companyId": "1068",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Spa Receptionist",
  "jobUrl": "https://ae.linkedin.com/jobs/view/spa-receptionist-at-bab-al-shams-desert-resort-3874689404?trk=public_jobs_topcard-title",
  "companyName": "Bab Al Shams Desert Resort",
  "companyUrl": "https://www.linkedin.com/company/bab-al-shams-desert-resort?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "( 7287 )\n\nRare Finds is a diverse collection of resorts celebrating the individuality and unique identity of a destination, with a distinct ability to captivate the imagination, and bring to the forefront the essence of a place.\n\nAuthentic and captivating, Bab Al Shams Desert Resort is a truly magical destination, where expertly curated itineraries and bespoke entertainment are the beating heart of our legendary desert-based destination. Part of our unique Rare Finds collection, the essence of Bab Al Shams joins our guests together to discover the most soulful experiences and humbling journeys, set against Dubai’s endless dunes and rich culture.\n\nAbout The Role\n\n\n * Ensures professional and consistent SPA services according to the Leading Quality Assurance (LQA) assessment the global market leader in quality assurance assessments and benchmarking analysis for the luxury hospitality industry.\n * Ensuring the Spa reception is completely complying with all required standards as specified and mandated by the leading Quality Assurance assessment.\n * Delivering high standard of customer satisfaction and other related supporting services to all guests.\n   \n   \n\nResponsibilities\n\nKey Duties And Responsibilities\n\n\n * Billing treatments accurately and on time, charging accordingly through room charge, online payment & Credit Card.\n * Ensuring required discounts and offers are applied.\n * Ensuring treatments are collected on time and dealing with any issues rapidly and in a professional manner.\n * Keeping the reception area clean & tidy and maintaining a consistent presence at the desk.\n * Making sure the treatments booked are accurate and booked in a suitable time frame.\n * Having knowledge of the type of treatments available and be able to give advice on treatment procedures and contra-indications.\n * Use initiative when dealing with guests who have contra-indications to find suitable alternatives.\n * General administration duties including ensuring the required information and items needed are replenished and ready for use.\n * To communicate relevant information to the Therapists, Duty Manager and Senior team.\n * Demonstrate high levels of customer service and satisfaction by going the extra mile and exceeding expectation.\n * Drive desk sales and achieve targets for promotions and treatment launches.\n * Assist the Senior Therapist with utilising therapist space and rota management.\n * Carrying out any other reasonable tasks allocated by Management.\n * Need to handle and setup all treatment rooms and Wet areas in the absence of the attendant.\n * Direct guests to appointments and assist them in every way possible.\n * Assist guests with use of sauna, steam.\n * Understand and able to share information about all Spa services.\n * Knowledgeable about all Spa retail and professional items.\n * Ensure stocking of all spa amenities and toiletries.\n * Understands the company’s objectives and standards, values and culture of the company applying them on the job daily.\n * Adheres to the hotel’s policy relating to fire, hygiene, health and safety.\n * Achieves customers’ expectations and performance targets of the department.\n * Holds an impeccable personal grooming as per The Bab Al Shams Hotel Standards.\n * Welcomes the guests/clients to the SPA and engage them in conversation to determine the services that they need.\n * Work in close coordination with the rest of the Spa team.\n * Explains massage procedure and provide information about products used during treatments.\n * Act professional according to the LQA Standards with attention to detail and in a prompt timely manner.\n * Advises guests of SPA service programs, treatments and products available at the SPA including retail.\n * Assists in promoting Spa & body retail products to guests and offer full product knowledge.\n * Ensures all treatment rooms are fully set up before beginning a treatment according to set standards and procedures.\n * Communicates with all related internal departments any guest related matters, products or equipment needs, technical service requests, etc.\n * Upholds the standards of hygiene and sterilization as directed by law and the spa’s policies and procedures.\n * Participate in regular trainings and spa meetings.\n * Responsible for monitoring all spa related facilities and processes including service standards and keeping the Senior Therapist updated of any issues that may affect the smooth operation of the spa.\n * Reports to supervisor unusual incidents, complaints, unauthorized persons, missing or damaged hotel property and lost and found items.\n * Participates in the multi skills philosophy of the department.\n * Responds to any changes in spa function as indicated by the company.\n * Communicates effectively and to respond well, to questions and requests.\n * Works in a team, i.e. caring about other team members and different nationalities.\n * Assist other departments when requested to.\n   \n   \n\nRequirements\n\nSkills, Experience & Educational Requirements\n\n\n * 3 years in similar position in a five star hotel.\n * Knowledge in micros Microsoft office word/excel/power point.\n * Time management.\n * People management experience\n * Highly organized and proactive and be able to meet deadlines in a fast-paced environment\n * Presentation skills\n * Effective Communication\n * Attention to detail\n * Customer focused\n * Team work\n * Interpersonal skills\n   \n   \n\nJoin a team that is warm , caring , connected and empowered to create truly unique experiences. We believe in making our guests happy beyond anything they have ever imagined. We wow them at every turn and create memories that will last a lifetime. You will be at the heart of this vision, to constantly innovate to deliver Amazing Experiences and Everlasting Memories.",
  "contractType": "Full-time",
  "experienceLevel": "Entry level",
  "workType": "Administrative",
  "sector": "Hospitality",
  "applyUrl": "https://jobs.kerzner.com/job/Dubai-Spa-Receptionist/730945622/?utm_source=LINKEDIN&utm_medium=referrer",
  "applyType": "EXTERNAL",
  "companyId": "36920112",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Customer Service Associate",
  "jobUrl": "https://ae.linkedin.com/jobs/view/customer-service-associate-3979484048?trk=public_jobs_topcard-title",
  "companyName": "",
  "companyUrl": "",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "13 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "The customer service associate will be instrumental in customer retention by addressing concerns and product issues, and by communicating in a professional, positive manner. You will apply your multitasking skills by listening and speaking to customers, navigating computers, and typing call documentation simultaneously. You will have the ability to swiftly gain customer confidence and trust.\n\nCustomer Service Associate Responsibilities\n\nAttending training sessions to grow knowledge of products and to develop customer service skills.\n\nResolving phone, walk-in, mail, fax, and email customer inquiries.\n\nProcessing and logging incoming calls into the CRM system.\n\nIdentifying customer needs.\n\nForwarding and escalating inquiries to relevant individuals and departments.\n\nContacting customers to give them accurate feedback on the progress of their inquiries.\n\nOther Details\n\nSalary-31,000/- to 45,000/-\n\nRequired Experience-0 To 5\n\nMinimum Age-18\n\nCustomer Service Associate Requirements\n\nQualification Required-Diploma,Btech,M.tech,ITI,12th,All Graduate,HSC\n\nWork Department-Customer Service\n\nWork Industry-IT,Banking,Finance,Education,E-Commerce,Telecom\n\nSkills-Outstanding communication skills, both verbal and written.\n\nKnowledge of programming language and technical terminology.\n\nfor more clarification contact to this number-7042633859\n\nsrv9082@gmail.com\n\nRegards\n\nHR Placement Team\n\nThis job is provided by Shine.com",
  "contractType": "Full-time",
  "experienceLevel": "Entry level",
  "workType": "Other",
  "sector": "Staffing and Recruiting",
  "applyUrl": "https://www.shine.com/jobs/customer-service-associate/neelima-staffing-solution/15283711/?utm_source=linkedin-feed&amp;utm_medium=referral&amp;utm_campaign=linkedin-feed&amp;auto_apply=true",
  "applyType": "EXTERNAL",
  "companyId": "",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "Lead Data Engineer – Data Platform (Bangkok-Based, Relocation Provided)",
  "jobUrl": "https://ae.linkedin.com/jobs/view/lead-data-engineer-%E2%80%93-data-platform-bangkok-based-relocation-provided-at-agoda-3927615157?trk=public_jobs_topcard-title",
  "companyName": "Agoda",
  "companyUrl": "https://sg.linkedin.com/company/agoda?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "About Agoda\n\nAgoda is an online travel booking platform for accommodations, flights, and more. We build and deploy cutting-edge technology that connects travelers with more than 3.6 million accommodations globally. Based in Asia and part of Booking Holdings, our 6,000+ employees representing 90+ nationalities foster a work environment rich in diversity, creativity, and collaboration. We innovate through a culture of experimentation and ownership, enhancing the ability for our customers to experience the world.\n\nOur Purpose – Bridging the World Through Travel\n\nWe believe travel allows people to enjoy, learn and experience more of the amazing world we live in. It brings individuals and cultures closer together, fostering empathy, understanding and happiness.\n\nWe are a skillful, driven and diverse team from across the globe, united by a passion to make an impact. Harnessing our innovative technologies and strong partnerships, we aim to make travel easy and rewarding for everyone.\n\nGet to Know Our Team\n\nThe Data department oversees all of Agoda’s data-related requirements. Our ultimate goal is to enable and increase the use of data in the company through creative approaches and the implementation of powerful resources such as operational and analytical databases, queue systems, BI tools, and data science technology. We hire the brightest minds from around the world to take on this challenge and equip them with the knowledge and tools that contribute to their personal growth and success while supporting our company’s culture of diversity and experimentation. The role the Data team plays at Agoda is critical as business users, product managers, engineers, and many others rely on us to empower their decision making. We are equally dedicated to our customers by improving their search experience with faster results and protecting them from any fraudulent activities. Data is interesting only when you have enough of it, and we have plenty. This is what drives up the challenge as part of the Data department, but also the reward.\n\nWhy Agoda Hadoop Apps Team?\n\nJoining this team, you will be solving some of the most difficult challenges out there today for the Hadoop ecosystem. We focus largely on building user tools and applications for other teams to use, most of these are built on top of Yarn utilizing Apache Spark as well as other cutting edge technologies.\n\nWe are also the engine that drives a fully functional world class data warehouse on top of Hadoop, this means providing tools to define data cubes and syncing high load of data from a processing Hadoop to other systems using in-house built Applications.\n\nIn this Role, you will get to\n\n\n * Lead the team technically in improving scalability, stability, accuracy, speed and efficiency of our existing Data Platform\n * Build, administer and scale Data Platform\n * Be comfortable navigating the following technology stack: S3, Kubernetes, KubeFlow, Spark, SQL, Impala, Scala, java, Python, scripting (Bash/Python) etc.\n * Work with experienced engineers to identify and build tools to automate many large-scale data platform management\n   \n   \n\nWhat You’ll Need To Succeed\n\n\n * Bachelor’s degree in Computer Science /Information Systems/Engineering/related field\n * 6+ years of experience in Data Platform Administration eg. Hadoop, S3, AWS, Google Cloud etc.\n * 6+ years of experience in Kubernetes Administration\n * Good experience in Apache Spark performance tuning and debugging\n * Good level understanding of JVM and either Java or Scala\n * Experience in WorkFlow Scheduler eg. KubeFlow, AirFlow, Oozie etc.\n * SQL experience eg. SparkSql, Impala, BigQuery, Presto/Trino, StarRocks etc.\n * Experience debugging and reasoning about production issues is desirable\n * Analytical problem-solving capabilities & experience.\n * Systems administration skills in Linux\n   \n   \n\nIt’s great if you have\n\n\n * Experience working with Open-source products\n * Python/Shell scripting skills\n * Working in an agile environment using test driven methodologies\n   \n   \n\n#telaviv #jerusalem #IT #ENG #4 #sanfrancisco #sanjose #losangeles #sandiego #oakland #denver #miami #orlando #atlanta #chicago #boston #detroit #newyork #portland #philadelphia #dallas #houston #austin #seattle #sydney #melbourne #perth #toronto #vancouver #montreal #prague #Brno #Ostrava #cairo #alexandria #giza #estonia #paris #berlin #munich #hamburg #stuttgart #cologne #frankfurt #budapest #bali #dublin #telaviv #milan #rome #venice #florence #naples #turin #palermo #bologna #osaka #malta #amsterdam #oslo #warsaw #krakow #alrayyan #riyadh #jeddah #mecca #medina #singapore #seoul #barcelona #madrid #stockholm #zurich #taipei #tainan #taichung #kaohsiung #bangkok #Phuket #istanbul #london #manchester #edinburgh #hcmc #hanoi #lodz #wroclaw #poznan #katowice #rio #salvador #newdelhi #bangalore #bandung #yokohama #nagoya #okinawa #fukuoka #jerusalem #IT #4 #bangalore #delhi #hyderabad #pune #singapore #beijing #shanghai #shenzhen #tokyo #seoul #hongkong #taipei #kualalumpur #jakarta #hochiminh #hochiminhcity #manila #instanbul #makati #dubai #riyadh #gurgaon #noida\n\nEqual Opportunity Employer\n\nAt Agoda, we pride ourselves on being a company represented by people of all different backgrounds and orientations. We prioritize attracting diverse talent and cultivating an inclusive environment that encourages collaboration and innovation. Employment at Agoda is based solely on a person’s merit and qualifications. We are committed to providing equal employment opportunity regardless of sex, age, race, color, national origin, religion, marital status, pregnancy, sexual orientation, gender identity, disability, citizenship, veteran or military status, and other legally protected characteristics.\n\nWe will keep your application on file so that we can consider you for future vacancies and you can always ask to have your details removed from the file. For more details please read our privacy policy .\n\nTo all recruitment agencies: Agoda does not accept third party resumes. Please do not send resumes to our jobs alias, Agoda employees or any other organization location. Agoda is not responsible for any fees related to unsolicited resumes.\n\n",
  "contractType": "Full-time",
  "experienceLevel": "Mid-Senior level",
  "workType": "Information Technology",
  "sector": "Technology, Information and Internet",
  "applyUrl": "https://careersatagoda.com/job/5967391-lead-data-engineer-data-platform-bangkok-based-relocation-provided/?gh_jid=5967391&gh_src=7ec7ab9a1",
  "applyType": "EXTERNAL",
  "companyId": "66719",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "General Manager - South East Asia | UAE",
  "jobUrl": "https://ae.linkedin.com/jobs/view/general-manager-south-east-asia-uae-at-taptap-send-3926790248?trk=public_jobs_topcard-title",
  "companyName": "Taptap Send",
  "companyUrl": "https://www.linkedin.com/company/taptapsend?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "8 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Our Mission\n\nReduce inequity by helping immigrants move money home, and become the leading cross-border fintech for emerging markets.\n\nThe Team\n\n\n * > Founded by Harvard grads / 3rd-time founders --- also founded Segovia (successful exit) and GiveDirectly (>300M revenue, fastest-growing NGO).\n * > Top performers from top and varied organizations (e.g., Bain, Bolt, Google, McKinsey, SafeBoda, Uber, Zipline) --- we like moving fast, and we hire people that do as well.\n * > Driven by mission, guided by values (see below) – in deed, not just word.\n * > Team as global as the mission, >30 languages from 25 countries (i.e., if you’re interested in learning to make Chicken Moambe, we’re the place).\n   \n   \n\nAbout Us\n\nTaptap Send is backed by top VCs (Spark, Canaan, Reid Hoffman, Breyer Capital, etc.), rapidly growing and a great place for those looking for both impact and a fast-paced tech startup environment. Read more about the journey in Reid Hoffman’s words or TechCrunch article\n\nLaunched in 2019, Taptap is tapping into a transformative shift in global finance: from banks to phones. While this has affected wealthier countries as well, it has been nothing short of a revolution for the emerging markets where the overwhelming majority of population had been unable to access digital finance previously. Taptap Send allows immigrants to send money home instantly and with no fee*, saving money in the process. With a formal market size of >700B alone, we’ve got a lot more saving to do for our users. Our mission is to reduce inequity by helping immigrants move money home, and become the leading cross-border fintech for emerging markets. And that’s just the beginning...\n\n\n * We charge fees for transfers on fixed exchange rate corridors (e.g., XOF, XAF).\n   \n   \n\nOur Investors\n\nSpark Capital, Canaan, Reid Hoffman, Breyer Capital (Jim Breyer), Unbound (Shravin Mittal), Wamda (Fadi Ghandour), Firstminute Capital, Slow Ventures (Sam Lessin), Helios Partners (Souleymane Ba), Crossbeam Ventures (Ali Hamed), Nikesh Arora, Samih Toukan, and many other context-specific angels\n\nThe Role\n\nAs the Philippines Country Manager your role will be to develop and scale Taptap Send’s growth amongst the diaspora in key sender-side markets: US and Canada to start.\n\nYou will be excited to manage every aspect of growth in said markets: customer acquisition and retention strategy, pricing, user research, product quality, customer experience, team development and coaching. You will have an acute “own it” mindset, equally obsessed with the experience of individual users as with iterating and optimizing scalable growth tactics and processes.\n\nYou will have P&L ownership, delivering the growth and profitability targets for the Philippines market. You will seek to establish TTS as the leading product/service for sending remittances to the Philippines, whilst being the “face” of the Philippines both internally and externally. Reporting directly into the Regional Director for Asia, and building and leading a team of growth managers on the ground in sending markets, the role offers the chance to join an early-stage, high growth startup and to have a positive impact on the communities we serve.\n\nResponsibilities\n\n\n * Establish a vision, strategy and execution plan for the Philippines and all send\n * Lead the team on the ground to execute within collaboratively aligned timelines\n * Manage every aspect of growth across the sending countries: customer acquisition and retention strategy, pricing, user research, product quality, customer experience, team development and coaching\n * Report to the executive leadership team on progress, insights and needs, leveraging operational prowess with a data-driven test-and-learn mindset\n * Think creatively on ways to unlock growth, improve profitability and increase brand awareness\n * Hire, inspire, develop and retain top, diverse talent\n * Collaborate closely with both internal and external stakeholders including the Customer Service, Finance, Tech, Legal, Financial Crime, Compliance, People Ops and more\n * Build trust-based relationships with diaspora communities and commercial partners in the Philippines to increase brand awareness and unlock growth and unit economics improvements\n * Monitor, understand, and interpret specific growth, operational, and financial metrics to improve execution\n * Recommend improvements to product experience based on market, competitor and customer insights and feedback\n   \n   \n\nRequirements\n\n\n * Strong preference to be based in the UAE\n * Ability to travel internationally periodically and ad-hoc to meet customers, partners and team members\n * Exceptional knowledge and networks in the the Philippines diaspora\n * Advanced stakeholder management capability\n * Experience building, developing, managing and leading teams\n * Strong analytical skills and ability to make data-driven decisions. Familiarity with pulling and presenting insights from data using Excel / Google suite. SQL, Python, R is a plus\n * 7 to 15 years experience in a fast paced and high growth-environment such as startups, operations, consulting, finance, or similar\n * An acute “own it” mindset, equally obsessed with the experience of individual users as with iterating and optimizing scalable growth tactics and processes\n * Bachelors or Advanced degree\n * Fluency in English and Tagalog; other languages a plus\n   \n   \n\nAlso You Are\n\n\n * Execution oriented - we have an “impact first” philosophy and a lot to be done. You should be able to prioritize and take ideas to implementation\n * Customer-centric - you love speaking to people and enjoy building meaningful relationships with customers and community members across cultures\n * Mission-Oriented - you are passionate about working with immigrant communities and/or financial inclusion\n * Flexible - you are comfortable setting your working hours to accomplish your goals, including work commitments on nights and weekends (e.g., events or customer meetings)\n * Organized - you have a system for how you approach your work that can keep you on track in a scrappy startup environment\n * Driven - you thrive in fast-paced, target oriented environments\n   \n   \n\nTaptap Values\n\nImpact first\n\nTeam next\n\nAccept reality\n\nPropose solutions\n\nWin with grit\n\nBe proactively candid, with yourself and others\n\nLove the particular\n\nOwn it\n\nCreate positive energy\n\nMaybe, even have fun\n\nTaptap Send is an equal opportunity employer dedicated to building an inclusive and diverse workforce. All employment decisions are decided on the basis of qualifications, experience and business need. We strongly encourage applications who are members of underrepresented communities to apply.\n\nIf you require reasonable adjustments to be made during the recruitment process, please do not hesitate to let us know. Any information you provide us in this respect will only be used to accommodate your requirements.\n\nNote: we recognize imposter syndrome is real - any candidate that does not perfectly fit every characteristic of this role is still strongly encouraged to apply.",
  "contractType": "Full-time",
  "experienceLevel": "Executive",
  "workType": "Management and Manufacturing",
  "sector": "Financial Services",
  "applyUrl": "https://jobs.ashbyhq.com/TaptapSend/4eeb8647-af10-4fed-bf49-d235feb17e40/application?utm_source=b9adZB9JWv",
  "applyType": "EXTERNAL",
  "companyId": "29024390",
  "posterProfileUrl": "",
  "posterFullName": ""
},
{
  "publishedAt": "2024-07-21",
  "salary": "",
  "title": "ACCOUNT MANAGER",
  "jobUrl": "https://ae.linkedin.com/jobs/view/account-manager-at-jobs-via-efinancialcareers-3979894156?trk=public_jobs_topcard-title",
  "companyName": "Jobs via eFinancialCareers",
  "companyUrl": "https://uk.linkedin.com/company/jobs-on-efinancialcareers?trk=public_jobs_topcard-org-name",
  "location": "Dubai, Dubai, United Arab Emirates",
  "postedTime": "2 hours ago",
  "applicationsCount": "Be among the first 25 applicants",
  "description": "Allianz Group is one of the most trusted insurance and asset management companies in the world We are hiring for an Account Manager to join our team in Dubai.\n\nYour role & Key Responsibilities:\n\n\n * Be a point of contact for your clients and develop a strong, long-lasting relationship.\n * Maximize the retention of your portfolio\n * Ensure proper pricing based on your policy performance\n * Identify cross and up-selling opportunities\n * Service customers based on company's Service Model\n * Interact closely with the other core functions (i.e., Risk, Claims, etc)\n * Apply commercial underwriting standards to ensure profitability and quality of customer portfolio.\n * Identify upselling opportunities\n * Ensure long-term profitability and quality of customer portfolio.\n   \n   \n   \n\nKey requirements/What you bring:\n\n\n * Market knowledge and Product Excellence:\n    * Become ambassador of Allianz Trade to the market and offer services supporting the market position of the company\n    * Ability to establish and retain a positive network within the market with specific focus on key decision makers and influencers.\n    * Develop technical knowledge\n\n * Interpersonal skills:\n    * Active listening skills\n    * Adaptability and problem-solving skills\n    * Ability to collect, track and analyze data\n    * Organizational skills and attention to detail\n    * Strong written and verbal communication skills\n    * Ability to multitask and juggle several communication skills\n    * Be able to control and manage negotiations effectively\n\n * Preferred:\n    * Trade Credit Insurance knowledge\n    * Arabic Speaker\n      \n      \n\nCaring for our employees, their ambitions, dreams and challenges, is what makes us a unique employer. Together we can build an environment where everyone feels empowered and has the confidence to explore, to grow and to shape a better future for our customers and the world around us.We at Allianz believe in a diverse and inclusive workforce and are proud to be an equal opportunity employer. We encourage you to bring your whole self to work, no matter where you are from, what you look like, who you love or what you believe in.We therefore welcome applications regardless of ethnicity or cultural background, age, gender, nationality, religion, disability or sexual orientation.Join us. Let's care for tomorrow.\n\n",
  "contractType": "Full-time",
  "experienceLevel": "Entry level",
  "workType": "Sales and Business Development",
  "sector": "Staffing and Recruiting",
  "applyUrl": "https://click.appcast.io/track/k4llga8?cs=lhp&jg=5jgw&bid=q948nGl57dNhZO5Va2AQmA==",
  "applyType": "EXTERNAL",
  "companyId": "37778197",
  "posterProfileUrl": "",
  "posterFullName": ""
}]